{
	"\"The '{{.minikube_addon}}' addon is disabled": "",
	"\"{{.context}}\" context has been updated to point to {{.hostname}}:{{.port}}": "",
	"\"{{.machineName}}\" does not exist, nothing to stop": "",
	"\"{{.name}}\" profile does not exist": "El perfil \"{{.name}}\" no existe",
	"\"{{.name}}\" profile does not exist, trying anyways.": "",
	"'none' driver does not support 'minikube docker-env' command": "",
	"'none' driver does not support 'minikube mount' command": "",
	"'none' driver does not support 'minikube podman-env' command": "",
	"'none' driver does not support 'minikube ssh' command": "",
	"'{{.driver}}' driver reported a issue that could affect the performance.": "",
	"'{{.driver}}' driver reported an issue: {{.error}}": "",
	"- Delete and recreate minikube cluster\n\t\tminikube delete\n\t\tminikube start --driver={{.driver_name}}": "",
	"- Docs https://docs.docker.com/docker-for-mac/#resources": "",
	"- Docs https://docs.docker.com/docker-for-windows/#resources": "",
	"- Ensure your {{.driver_name}} daemon has access to enough CPU/memory resources.": "",
	"- Prune unused {{.driver_name}} images, volumes and abandoned containers.": "",
	"- Restart your {{.driver_name}} service": "",
	"A VPN or firewall is interfering with HTTP access to the minikube VM. Alternatively, try a different VM driver: https://minikube.sigs.k8s.io/docs/start/": "",
	"A firewall is blocking Docker the minikube VM from reaching the image repository. You may need to select --image-repository, or use a proxy.": "",
	"A firewall is interfering with minikube's ability to make outgoing HTTPS requests. You may need to change the value of the HTTPS_PROXY environment variable.": "",
	"A firewall is likely blocking minikube from reaching the internet. You may need to configure minikube to use a proxy.": "",
	"A set of apiserver IP Addresses which are used in the generated certificate for kubernetes.  This can be used if you want to make the apiserver available from outside the machine": "",
	"A set of apiserver IP Addresses which are used in the generated certificate for kubernetes. This can be used if you want to make the apiserver available from outside the machine": "Un conjunto de direcciones IP de apiserver que se usan en el certificado de Kubernetes generado. Se pueden utilizar para que sea posible acceder al apiserver desde fuera de la máquina",
	"A set of apiserver names which are used in the generated certificate for kubernetes.  This can be used if you want to make the apiserver available from outside the machine": "",
	"A set of apiserver names which are used in the generated certificate for kubernetes. This can be used if you want to make the apiserver available from outside the machine": "Un conjunto de nombres de apiserver que se usan en el certificado de Kubernetes generado. Se pueden utilizar para que sea posible acceder al apiserver desde fuera de la máquina",
	"A set of key=value pairs that describe configuration that may be passed to different components.\nThe key should be '.' separated, and the first part before the dot is the component to apply the configuration to.\nValid components are: kubelet, kubeadm, apiserver, controller-manager, etcd, proxy, scheduler\nValid kubeadm parameters:": "Un conjunto de pares clave=valor que describen la configuración que se puede transferir a diferentes componentes.\nLa clave debe estar separada por un \".\", y la primera parte antes del punto es el componente al que se quiere aplicar la configuración.\nEstos son los componentes válidos: kubelet, kubeadm, apiserver, controller-manager, etcd, proxy y scheduler\nEstos son los parámetros de kubeadm válidos:",
	"A set of key=value pairs that describe feature gates for alpha/experimental features.": "Un conjunto de pares clave=valor que indican si las funciones experimentales o en versión alfa deben estar o no habilitadas.",
	"Access the Kubernetes dashboard running within the minikube cluster": "",
	"Add an image to local cache.": "",
	"Add machine IP to NO_PROXY environment variable": "",
	"Add, delete, or push a local image into minikube": "",
	"Add, remove, or list additional nodes": "",
	"Adding node {{.name}} to cluster {{.cluster}}": "",
	"Additional help topics": "",
	"Additional mount options, such as cache=fscache": "",
	"Adds a node to the given cluster config, and starts it.": "",
	"Adds a node to the given cluster.": "",
	"Advanced Commands:": "",
	"Aliases": "",
	"Allow user prompts for more information": "",
	"Alternative image repository to pull docker images from. This can be used when you have limited access to gcr.io. Set it to \\\"auto\\\" to let minikube decide one for you. For Chinese mainland users, you may use local gcr.io mirrors such as registry.cn-hangzhou.aliyuncs.com/google_containers": "Repositorio de imágenes alternativo del que extraer imágenes de Docker. Puedes usarlo cuando tengas acceso limitado a gcr.io. Si quieres que minikube elija uno por ti, solo tienes que definir el valor como \"auto\". Los usuarios de China continental pueden utilizar réplicas locales de gcr.io, como registry.cn-hangzhou.aliyuncs.com/google_containers",
	"Amount of RAM allocated to the minikube VM (format: \u003cnumber\u003e[\u003cunit\u003e], where unit = b, k, m or g)": "Cantidad de RAM asignada a la VM de minikube (formato: \u003cnúmero\u003e[\u003cunidad\u003e], donde unidad = b, k, m o g)",
	"Amount of RAM to allocate to Kubernetes (format: \u003cnumber\u003e[\u003cunit\u003e], where unit = b, k, m or g).": "",
	"Amount of time to wait for a service in seconds": "",
	"Amount of time to wait for service in seconds": "",
	"Another hypervisor, such as VirtualBox, is conflicting with KVM. Please stop the other hypervisor, or use --driver to switch to it.": "",
	"Another program is using a file required by minikube. If you are using Hyper-V, try stopping the minikube VM from within the Hyper-V manager": "",
	"Automatically selected the {{.driver}} driver": "",
	"Automatically selected the {{.driver}} driver. Other choices: {{.alternates}}": "",
	"Available Commands": "",
	"Basic Commands:": "",
	"Because you are using a Docker driver on {{.operating_system}}, the terminal needs to be open to run it.": "",
	"Bind Address: {{.Address}}": "",
	"Both driver={{.driver}} and vm-driver={{.vmd}} have been set.\n\n    Since vm-driver is deprecated, minikube will default to driver={{.driver}}.\n\n    If vm-driver is set in the global config, please run \"minikube config unset vm-driver\" to resolve this warning.": "",
	"CNI plug-in to use. Valid options: auto, bridge, calico, cilium, flannel, kindnet, or path to a CNI manifest (default: auto)": "",
	"Cannot find directory {{.path}} for mount": "",
	"Cannot use both --output and --format options": "",
	"Check if you have unnecessary pods running by running 'kubectl get po -A": "",
	"Check output of 'journalctl -xeu kubelet', try passing --extra-config=kubelet.cgroup-driver=systemd to minikube start": "",
	"Check that SELinux is disabled, and that the provided apiserver flags are valid": "",
	"Check that minikube is running and that you have specified the correct namespace (-n flag) if required.": "",
	"Check that the provided apiserver flags are valid, and that SELinux is disabled": "",
	"Check that your --kubernetes-version has a leading 'v'. For example: 'v1.1.14'": "",
	"Check your firewall rules for interference, and run 'virt-host-validate' to check for KVM configuration issues. If you are running minikube within a VM, consider using --driver=none": "",
	"Choose a smaller value for --memory, such as 2000": "",
	"Configuration and Management Commands:": "",
	"Configure a default route on this Linux host, or use another --driver that does not require it": "",
	"Configure an external network switch following the official documentation, then add `--hyperv-virtual-switch=\u003cswitch-name\u003e` to `minikube start`": "",
	"Configure environment to use minikube's Docker daemon": "",
	"Configure environment to use minikube's Podman service": "",
	"Configures the addon w/ADDON_NAME within minikube (example: minikube addons configure registry-creds). For a list of available addons use: minikube addons list": "",
	"Configuring local host environment ...": "",
	"Configuring {{.name}} (Container Networking Interface) ...": "",
	"Confirm that you have a working internet connection and that your VM has not run out of resources by using: 'minikube logs'": "",
	"Confirm that you have supplied the correct value to --hyperv-virtual-switch using the 'Get-VMSwitch' command": "",
	"Connect to LoadBalancer services": "",
	"Consider creating a cluster with larger memory size using `minikube start --memory SIZE_MB`": "",
	"Consider increasing Docker Desktop's memory size.": "",
	"Could not determine a Google Cloud project, which might be ok.": "",
	"Could not find any GCP credentials. Either run `gcloud auth login` or set the GOOGLE_APPLICATION_CREDENTIALS environment variable to the path of your credentials file.": "",
	"Could not process error from failed deletion": "",
	"Could not process errors from failed deletion": "",
	"Country code of the image mirror to be used. Leave empty to use the global one. For Chinese mainland users, set it to cn.": "Código de país de la réplica de imagen que quieras utilizar. Déjalo en blanco para usar el valor global. Los usuarios de China continental deben definirlo como cn.",
	"Creating mount {{.name}} ...": "Creando la activación {{.name}}...",
	"Creating {{.driver_name}} {{.machine_type}} (CPUs={{.number_of_cpus}}, Memory={{.memory_size}}MB) ...": "",
	"Creating {{.driver_name}} {{.machine_type}} (CPUs={{.number_of_cpus}}, Memory={{.memory_size}}MB, Disk={{.disk_size}}MB) ...": "",
	"DEPRECATED, use `driver` instead.": "",
	"DEPRECATED: Replaced by --cni=bridge": "",
	"Default group id used for the mount": "",
	"Default user id used for the mount": "",
	"Delete an image from the local cache.": "",
	"Deletes a local Kubernetes cluster": "",
	"Deletes a local Kubernetes cluster. This command deletes the VM, and removes all\nassociated files.": "",
	"Deletes a local kubernetes cluster. This command deletes the VM, and removes all associated files.": "Elimina un clúster local de Kubernetes. Este comando borra la VM y todos los archivos asociados.",
	"Deletes a node from a cluster.": "",
	"Deleting \"{{.profile_name}}\" in {{.driver_name}} ...": "Eliminando \"{{.profile_name}}\" en {{.driver_name}}...",
	"Deleting container \"{{.name}}\" ...": "",
	"Deleting node {{.name}} from cluster {{.cluster}}": "",
	"Disable checking for the availability of hardware virtualization before the vm is started (virtualbox driver only)": "Permite inhabilitar la comprobación de disponibilidad de la virtualización de hardware antes de iniciar la VM (solo con el controlador de Virtualbox)",
	"Disable dynamic memory in your VM manager, or pass in a larger --memory value": "",
	"Disables the addon w/ADDON_NAME within minikube (example: minikube addons disable dashboard). For a list of available addons use: minikube addons list": "",
	"Disables the filesystem mounts provided by the hypervisors": "Inhabilita las activaciones de sistemas de archivos proporcionadas por los hipervisores",
	"Disk size allocated to the minikube VM (format: \u003cnumber\u003e[\u003cunit\u003e], where unit = b, k, m or g)": "Tamaño de disco asignado a la VM de minikube (formato: \u003cnúmero\u003e[\u003cunidad\u003e], donde unidad = b, k, m o g)",
	"Disk size allocated to the minikube VM (format: \u003cnumber\u003e[\u003cunit\u003e], where unit = b, k, m or g).": "",
	"Display dashboard URL instead of opening a browser": "",
	"Display the Kubernetes addons URL in the CLI instead of opening it in the default browser": "",
	"Display the Kubernetes service URL in the CLI instead of opening it in the default browser": "",
	"Display values currently set in the minikube config file": "",
	"Display values currently set in the minikube config file.": "",
	"Docker inside the VM is unavailable. Try running 'minikube delete' to reset the VM.": "",
	"Docs have been saved at - {{.path}}": "",
	"Documentation: {{.url}}": "",
	"Done! kubectl is now configured to use \"{{.name}}": "¡Listo! Se ha configurado kubectl para que use \"{{.name}}",
	"Done! kubectl is now configured to use \"{{.name}}\"": "",
	"Done! kubectl is now configured to use \"{{.name}}__1": "¡Listo! Se ha configurado kubectl para que use \"{{.name}}",
	"Download complete!": "Se ha completado la descarga",
	"Downloading Kubernetes {{.version}} preload ...": "",
	"Downloading VM boot image ...": "",
	"Downloading driver {{.driver}}:": "",
	"Due to issues with CRI-O post v1.17.3, we need to restart your cluster.": "",
	"Due to networking limitations of driver {{.driver_name}} on {{.os_name}}, {{.addon_name}} addon is not supported.\nAlternatively to use this addon you can use a vm-based driver:\n\n\t'minikube start --vm=true'\n\nTo track the update on this work in progress feature please check:\nhttps://github.com/kubernetes/minikube/issues/7332": "",
	"Due to networking limitations of driver {{.driver_name}}, {{.addon_name}} addon is not supported. Try using a different driver.": "",
	"ERROR creating `registry-creds-acr` secret": "",
	"ERROR creating `registry-creds-dpr` secret": "",
	"ERROR creating `registry-creds-ecr` secret: {{.error}}": "",
	"ERROR creating `registry-creds-gcr` secret: {{.error}}": "",
	"Either systemctl is not installed, or Docker is broken. Run 'sudo systemctl start docker' and 'journalctl -u docker'": "",
	"Enable addons. see `minikube addons list` for a list of valid addon names.": "",
	"Enable experimental NVIDIA GPU support in minikube": "Permite habilitar la compatibilidad experimental con GPUs NVIDIA en minikube",
	"Enable host resolver for NAT DNS requests (virtualbox driver only)": "Permite habilitar la resolución del host en las solicitudes DNS con traducción de direcciones de red (NAT) aplicada (solo con el controlador de Virtualbox)",
	"Enable or disable a minikube addon": "",
	"Enable proxy for NAT DNS requests (virtualbox driver only)": "Permite habilitar el uso de proxies en las solicitudes de DNS con traducción de direcciones de red (NAT) aplicada (solo con el controlador de Virtualbox)",
	"Enable the default CNI plugin (/etc/cni/net.d/k8s.conf). Used in conjunction with \\\"--network-plugin=cni\\": "Permite habilitar el complemento CNI predeterminado (/etc/cni/net.d/k8s.conf). Se utiliza junto con \"--network-plugin=cni",
	"Enabled addons: {{.addons}}": "",
	"Enables the addon w/ADDON_NAME within minikube (example: minikube addons enable dashboard). For a list of available addons use: minikube addons list": "",
	"Enabling '{{.name}}' returned an error: {{.error}}": "",
	"Enabling dashboard ...": "",
	"Ensure that CRI-O is installed and healthy: Run 'sudo systemctl start crio' and 'journalctl -u crio'. Alternatively, use --container-runtime=docker": "",
	"Ensure that Docker is installed and healthy: Run 'sudo systemctl start docker' and 'journalctl -u docker'. Alternatively, select another value for --driver": "",
	"Ensure that the user listed in /etc/libvirt/qemu.conf has access to your home directory": "",
	"Ensure that your value for HTTPS_PROXY points to an HTTPS proxy rather than an HTTP proxy": "",
	"Ensure the binaries are not mounted with \"noexec\" option. To check run:\n\n\t$ findmnt": "",
	"Ensure your {{.driver_name}} is running and is healthy.": "",
	"Ensure your {{.driver_name}} system has enough CPUs. The minimum allowed is 2 CPUs.": "",
	"Environment variables to pass to the Docker daemon. (format: key=value)": "Variables de entorno que se transferirán al daemon de Docker. Formato: clave=valor",
	"Error checking driver version: {{.error}}": "No se ha podido comprobar la versión del controlador: {{.error}}",
	"Error creating minikube directory": "",
	"Error creating view template": "",
	"Error detecting shell": "",
	"Error executing view template": "",
	"Error finding port for mount": "",
	"Error generating set output": "",
	"Error generating unset output": "",
	"Error getting cluster bootstrapper": "",
	"Error getting cluster config": "",
	"Error getting host": "",
	"Error getting port binding for '{{.driver_name}} driver: {{.error}}": "",
	"Error getting primary control plane": "",
	"Error getting service with namespace: {{.namespace}} and labels {{.labelName}}:{{.addonName}}: {{.error}}": "",
	"Error getting ssh client": "",
	"Error getting the host IP address to use from within the VM": "",
	"Error killing mount process": "",
	"Error loading profile config: {{.error}}": "",
	"Error loading profile {{.name}}: {{.error}}": "No se ha podido cargar el perfil {{.name}}: {{.error}}",
	"Error opening service": "",
	"Error parsing Driver version: {{.error}}": "No se ha podido analizar la versión de Driver: {{.error}}",
	"Error parsing minikube version: {{.error}}": "No se ha podido analizar la versión de minikube: {{.error}}",
	"Error parsing {{.name}}={{.value}}, {{.err}}": "",
	"Error reading {{.path}}: {{.error}}": "",
	"Error starting cluster": "",
	"Error starting mount": "",
	"Error while setting kubectl current context :  {{.error}}": "",
	"Error writing mount pid": "",
	"Error: You have selected Kubernetes v{{.new}}, but the existing cluster for your profile is running Kubernetes v{{.old}}. Non-destructive downgrades are not supported, but you can proceed by performing one of the following options:\n* Recreate the cluster using Kubernetes v{{.new}}: Run \"minikube delete {{.profile}}\", then \"minikube start {{.profile}} --kubernetes-version={{.new}}\"\n* Create a second cluster with Kubernetes v{{.new}}: Run \"minikube start -p \u003cnew name\u003e --kubernetes-version={{.new}}\"\n* Reuse the existing cluster with Kubernetes v{{.old}} or newer: Run \"minikube start {{.profile}} --kubernetes-version={{.old}}": "Error: Has seleccionado Kubernetes {{.new}}, pero el clúster de tu perfil utiliza la versión {{.old}}. No se puede cambiar a una versión inferior sin eliminar todos los datos y recursos pertinentes, pero dispones de las siguientes opciones para continuar con la operación:\n* Volver a crear el clúster con Kubernetes {{.new}}: ejecuta \"minikube delete {{.profile}}\" y, luego, \"minikube start {{.profile}} --kubernetes-version={{.new}}\"\n* Crear un segundo clúster con Kubernetes {{.new}}: ejecuta \"minikube start -p \u003cnuevo nombre\u003e --kubernetes-version={{.new}}\"\n* Reutilizar el clúster actual con Kubernetes {{.old}} o una versión posterior: ejecuta \"minikube start {{.profile}} --kubernetes-version={{.old}}",
	"Examples": "",
	"Executing \"{{.command}}\" took an unusually long time: {{.duration}}": "",
	"Existing disk is missing new features ({{.error}}). To upgrade, run 'minikube delete'": "",
	"Exiting": "Saliendo",
	"Exiting.": "",
	"External Adapter on which external switch will be created if no external switch is found. (hyperv driver only)": "",
	"Failed runtime": "",
	"Failed to cache and load images": "",
	"Failed to cache binaries": "",
	"Failed to cache images": "",
	"Failed to cache images to tar": "",
	"Failed to cache kubectl": "",
	"Failed to change permissions for {{.minikube_dir_path}}: {{.error}}": "No se han podido cambiar los permisos de {{.minikube_dir_path}}: {{.error}}",
	"Failed to check main repository and mirrors for images": "",
	"Failed to delete cluster {{.name}}, proceeding with retry anyway.": "",
	"Failed to delete cluster: {{.error}}": "No se ha podido eliminar el clúster: {{.error}}",
	"Failed to delete cluster: {{.error}}__1": "No se ha podido eliminar el clúster: {{.error}}",
	"Failed to delete images": "",
	"Failed to delete images from config": "",
	"Failed to enable container runtime": "",
	"Failed to get API Server URL": "",
	"Failed to get bootstrapper": "",
	"Failed to get command runner": "",
	"Failed to get image map": "",
	"Failed to get service URL: {{.error}}": "",
	"Failed to kill mount process: {{.error}}": "No se ha podido detener el proceso de activación: {{.error}}",
	"Failed to list cached images": "",
	"Failed to reload cached images": "",
	"Failed to save config {{.profile}}": "",
	"Failed to set NO_PROXY Env. Please use `export NO_PROXY=$NO_PROXY,{{.ip}}": "No se ha podido definir la variable de entorno NO_PROXY. Utiliza export NO_PROXY=$NO_PROXY,{{.ip}}",
	"Failed to set NO_PROXY Env. Please use `export NO_PROXY=$NO_PROXY,{{.ip}}`.": "",
	"Failed to setup certs": "",
	"Failed to start {{.driver}} {{.driver_type}}. \"{{.cmd}}\" may fix it: {{.error}}": "",
	"Failed to stop node {{.name}}": "",
	"Failed to update cluster": "",
	"Failed to update config": "",
	"Failed to validate '{{.driver}}' driver": "",
	"Failed to verify '{{.driver_name}} info' will try again ...": "",
	"Failed to verify system memory limits.": "",
	"Failed unmount: {{.error}}": "",
	"File permissions used for the mount": "",
	"Filter to use only VM Drivers": "",
	"Flags": "",
	"Follow": "",
	"For best results, install kubectl: https://kubernetes.io/docs/tasks/tools/install-kubectl/": "Para disfrutar de un funcionamiento óptimo, instala kubectl: https://kubernetes.io/docs/tasks/tools/install-kubectl/",
	"For best results, install kubectl: https://kubernetes.io/docs/tasks/tools/install-kubectl/__1": "Para disfrutar de un funcionamiento óptimo, instala kubectl: https://kubernetes.io/docs/tasks/tools/install-kubectl/",
	"For more information see: https://minikube.sigs.k8s.io/docs/drivers/{{.driver}}": "",
	"For more information, see:": "Para obtener más información, consulta lo siguiente:",
	"For more information, see: https://minikube.sigs.k8s.io/docs/reference/drivers/none/": "",
	"Force environment to be configured for a specified shell: [fish, cmd, powershell, tcsh, bash, zsh], default is auto-detect": "",
	"Force minikube to perform possibly dangerous operations": "Permite forzar minikube para que realice operaciones potencialmente peligrosas",
	"Format to print stdout in. Options include: [text,json]": "",
	"Found network options:": "Se han encontrado las siguientes opciones de red:",
	"Found {{.number}} invalid profile(s) !": "",
	"Generate command completion for a shell": "",
	"Generate unable to parse disk size '{{.diskSize}}': {{.error}}": "",
	"Generate unable to parse memory '{{.memory}}': {{.error}}": "",
	"Get or list the current profiles (clusters)": "",
	"Gets the logs of the running instance, used for debugging minikube, not user code.": "",
	"Gets the status of a local Kubernetes cluster": "",
	"Gets the status of a local Kubernetes cluster.\n\tExit status contains the status of minikube's VM, cluster and Kubernetes encoded on it's bits in this order from right to left.\n\tEg: 7 meaning: 1 (for minikube NOK) + 2 (for cluster NOK) + 4 (for Kubernetes NOK)": "",
	"Gets the value of PROPERTY_NAME from the minikube config file": "",
	"Global Flags": "",
	"Go template format string for the cache list output.  The format for Go templates can be found here: https://golang.org/pkg/text/template/\nFor the list of accessible variables for the template, see the struct values here: https://godoc.org/k8s.io/minikube/cmd/minikube/cmd#CacheListTemplate": "",
	"Go template format string for the config view output.  The format for Go templates can be found here: https://golang.org/pkg/text/template/\nFor the list of accessible variables for the template, see the struct values here: https://godoc.org/k8s.io/minikube/cmd/minikube/cmd/config#ConfigViewTemplate": "",
	"Go template format string for the status output.  The format for Go templates can be found here: https://golang.org/pkg/text/template/\nFor the list accessible variables for the template, see the struct values here: https://godoc.org/k8s.io/minikube/cmd/minikube/cmd#Status": "",
	"Group ID:     {{.groupID}}": "",
	"Have you set up libvirt correctly?": "",
	"Hide the hypervisor signature from the guest in minikube (kvm2 driver only)": "Permite ocultar la firma del hipervisor al invitado en minikube (solo con el controlador de kvm2)",
	"Hyperkit is broken. Upgrade to the latest hyperkit version and/or Docker for Desktop. Alternatively, you may choose an alternate --driver": "",
	"Hyperkit networking is broken. Upgrade to the latest hyperkit version and/or Docker for Desktop. Alternatively, you may choose an alternate --driver": "",
	"If set, automatically updates drivers to the latest version. Defaults to true.": "",
	"If set, delete the current cluster if start fails and try again. Defaults to false.": "",
	"If set, download tarball of preloaded images if available to improve start time. Defaults to true.": "",
	"If set, force the container runtime to use sytemd as cgroup manager. Currently available for docker and crio. Defaults to false.": "",
	"If set, install addons. Defaults to true.": "",
	"If set, pause all namespaces": "",
	"If set, unpause all namespaces": "",
	"If the above advice does not help, please let us know:": "",
	"If true, cache docker images for the current bootstrapper and load them into the machine. Always false with --driver=none.": "",
	"If true, cache docker images for the current bootstrapper and load them into the machine. Always false with --vm-driver=none.": "Si el valor es \"true\", las imágenes de Docker del programa previo actual se almacenan en caché y se cargan en la máquina. Siempre es \"false\" si se especifica --vm-driver=none.",
	"If true, only download and cache files for later use - don't install or start anything.": "Si el valor es \"true\", los archivos solo se descargan y almacenan en caché (no se instala ni inicia nada).",
	"If true, the added node will be marked for work. Defaults to true.": "",
	"If true, the node added will also be a control plane in addition to a worker.": "",
	"If using the none driver, ensure that systemctl is installed": "",
	"If you are running minikube within a VM, consider using --driver=none:": "",
	"If you are still interested to make {{.driver_name}} driver work. The following suggestions might help you get passed this issue:": "",
	"If you don't want your credentials mounted into a specific pod, add a label with the `gcp-auth-skip-secret` key to your pod configuration.": "",
	"Images Commands:": "",
	"In order to use the fall back image, you need to log in to the github packages registry": "",
	"Increase Docker for Desktop memory to at least 2.5GB or more:\n\t\t\t\n\tDocker for Desktop \u003e Settings \u003e Resources \u003e Memory": "",
	"Insecure Docker registries to pass to the Docker daemon.  The default service CIDR range will automatically be added.": "",
	"Insecure Docker registries to pass to the Docker daemon. The default service CIDR range will automatically be added.": "Registros de Docker que no son seguros y que se transferirán al daemon de Docker. Se añadirá automáticamente el intervalo CIDR de servicio predeterminado.",
	"Install VirtualBox and ensure it is in the path, or select an alternative value for --driver": "",
	"Install the latest hyperkit binary, and run 'minikube delete'": "",
	"Invalid Container Runtime: \"{{.runtime}}\". Valid runtimes are: {{.validOptions}}": "",
	"Istio needs {{.minCPUs}} CPUs -- your configuration only allocates {{.cpus}} CPUs": "",
	"Istio needs {{.minMem}}MB of memory -- your configuration only allocates {{.memory}}MB": "",
	"Kill the mount process spawned by minikube start": "",
	"Kubectl not found in your path": "",
	"Kubelet network plug-in to use (default: auto)": "",
	"Kubernetes {{.new}} is now available. If you would like to upgrade, specify: --kubernetes-version={{.prefix}}{{.new}}": "",
	"Kubernetes {{.version}} is not supported by this release of minikube": "",
	"Launching Kubernetes ...": "Iniciando Kubernetes...",
	"Launching proxy ...": "",
	"List all available images from the local cache.": "",
	"List existing minikube nodes.": "",
	"List nodes.": "",
	"List of guest VSock ports that should be exposed as sockets on the host (hyperkit driver only)": "Lista de puertos del VSock invitado que se deben mostrar como sockets en el host (solo con el controlador de hyperkit)",
	"Lists all available minikube addons as well as their current statuses (enabled/disabled)": "",
	"Lists all minikube profiles.": "",
	"Lists all valid default values for PROPERTY_NAME": "",
	"Lists all valid minikube profiles and detects all possible invalid profiles.": "",
	"Lists the URLs for the services in your local cluster": "",
	"Local folders to share with Guest via NFS mounts (hyperkit driver only)": "Carpetas locales que se compartirán con el invitado mediante activaciones de NFS (solo con el controlador de hyperkit)",
	"Location of the VPNKit socket used for networking. If empty, disables Hyperkit VPNKitSock, if 'auto' uses Docker for Mac VPNKit connection, otherwise uses the specified VSock (hyperkit driver only)": "Ubicación del socket de VPNKit que se utiliza para ofrecer funciones de red. Si se deja en blanco, se inhabilita VPNKitSock de Hyperkit; si se define como \"auto\", se utiliza Docker para las conexiones de VPNKit en Mac. Con cualquier otro valor, se utiliza el VSock especificado (solo con el controlador de hyperkit)",
	"Location of the minikube iso": "Ubicación de la ISO de minikube",
	"Locations to fetch the minikube ISO from.": "",
	"Log into or run a command on a machine with SSH; similar to 'docker-machine ssh'.": "",
	"Log into the minikube environment (for debugging)": "",
	"Message Size: {{.size}}": "",
	"Modify persistent configuration values": "",
	"Most users should use the newer 'docker' driver instead, which does not require root!": "",
	"Mount type:   {{.name}}": "",
	"Mounting host path {{.sourcePath}} into VM as {{.destinationPath}} ...": "",
	"Mounts the specified directory into minikube": "",
	"Mounts the specified directory into minikube.": "",
	"Multi-node clusters are currently experimental and might exhibit unintended behavior.": "",
	"Multiple errors deleting profiles": "",
	"Multiple minikube profiles were found -": "",
	"NIC Type used for host only network. One of Am79C970A, Am79C973, 82540EM, 82543GC, 82545EM, or virtio (virtualbox driver only)": "",
	"NOTE: This process must stay alive for the mount to be accessible ...": "",
	"Networking and Connectivity Commands:": "",
	"No changes required for the \"{{.context}}\" context": "",
	"No minikube profile was found. You can create one using `minikube start`.": "",
	"Node {{.name}} failed to start, deleting and trying again.": "",
	"Node {{.name}} was successfully deleted.": "",
	"Node {{.nodeName}} does not exist.": "",
	"Non-destructive downgrades are not supported, but you can proceed with one of the following options:\n\n  1) Recreate the cluster with Kubernetes {{.new}}, by running:\n\n    minikube delete{{.profile}}\n    minikube start{{.profile}} --kubernetes-version={{.prefix}}{{.new}}\n\n  2) Create a second cluster with Kubernetes {{.new}}, by running:\n\n    minikube start -p {{.suggestedName}} --kubernetes-version={{.prefix}}{{.new}}\n\n  3) Use the existing cluster at version Kubernetes {{.old}}, by running:\n\n    minikube start{{.profile}} --kubernetes-version={{.prefix}}{{.old}}": "",
	"None of the known repositories in your location are accessible. Using {{.image_repository_name}} as fallback.": "No se puede acceder a ninguno de los repositorios conocidos de tu ubicación. Se utilizará {{.image_repository_name}} como alternativa.",
	"None of the known repositories is accessible. Consider specifying an alternative image repository with --image-repository flag": "No se puede acceder a ninguno de los repositorios conocidos. Plantéate indicar un repositorio de imágenes alternativo con la marca --image-repository.",
	"Not passing {{.name}}={{.value}} to docker env.": "",
	"Noticed you have an activated docker-env on {{.driver_name}} driver in this terminal:": "",
	"Noticed you have an activated podman-env on {{.driver_name}} driver in this terminal:": "",
	"Number of CPUs allocated to Kubernetes.": "",
	"Number of CPUs allocated to the minikube VM": "Número de CPU asignadas a la VM de minikube",
	"Number of lines back to go within the log": "",
	"OS release is {{.pretty_name}}": "",
	"One of 'yaml' or 'json'.": "",
	"Only alphanumeric and dashes '-' are permitted. Minimum 1 character, starting with alphanumeric.": "",
	"Open the addons URL with https instead of http": "",
	"Open the service URL with https instead of http": "",
	"Opening Kubernetes service  {{.namespace_name}}/{{.service_name}} in default browser...": "",
	"Opening service {{.namespace_name}}/{{.service_name}} in default browser...": "",
	"Opening {{.url}} in your default browser...": "",
	"Opens the addon w/ADDON_NAME within minikube (example: minikube addons open dashboard). For a list of available addons use: minikube addons list": "",
	"Operations on nodes": "",
	"Options:      {{.options}}": "",
	"Output format. Accepted values: [json]": "",
	"Outputs minikube shell completion for the given shell (bash, zsh or fish)\n\n\tThis depends on the bash-completion binary.  Example installation instructions:\n\tOS X:\n\t\t$ brew install bash-completion\n\t\t$ source $(brew --prefix)/etc/bash_completion\n\t\t$ minikube completion bash \u003e ~/.minikube-completion  # for bash users\n\t\t$ minikube completion zsh \u003e ~/.minikube-completion  # for zsh users\n\t\t$ source ~/.minikube-completion\n\t\t$ minikube completion fish \u003e ~/.config/fish/completions/minikube.fish # for fish users\n\tUbuntu:\n\t\t$ apt-get install bash-completion\n\t\t$ source /etc/bash-completion\n\t\t$ source \u003c(minikube completion bash) # for bash users\n\t\t$ source \u003c(minikube completion zsh) # for zsh users\n\t\t$ minikube completion fish \u003e ~/.config/fish/completions/minikube.fish # for fish users\n\n\tAdditionally, you may want to output the completion to a file and source in your .bashrc\n\n\tNote for zsh users: [1] zsh completions are only supported in versions of zsh \u003e= 5.2\n\tNote for fish users: [2] please refer to this docs for more details https://fishshell.com/docs/current/#tab-completion": "",
	"Pause": "",
	"Paused {{.count}} containers": "",
	"Paused {{.count}} containers in: {{.namespaces}}": "",
	"Pausing node {{.name}} ...": "",
	"Permissions:  {{.octalMode}} ({{.writtenMode}})": "",
	"Please change Docker settings to use Linux containers instead of Windows containers.": "",
	"Please consider changing your Docker Desktop's resources.": "",
	"Please create a cluster with bigger disk size: `minikube start --disk SIZE_MB`": "",
	"Please either authenticate to the registry or use --base-image flag to use a different registry.": "",
	"Please ensure your system has {{.cpu_counts}} CPU cores.": "",
	"Please ensure your {{.driver_name}} system has access to {{.cpu_counts}} CPU cores or reduce the number of the specified CPUs": "",
	"Please enter a value:": "",
	"Please free up disk or prune images.": "",
	"Please increse Desktop's disk size.": "",
	"Please install the minikube hyperkit VM driver, or select an alternative --driver": "",
	"Please install the minikube kvm2 VM driver, or select an alternative --driver": "",
	"Please make sure the service you are looking for is deployed or is in the correct namespace.": "",
	"Please re-eval your docker-env, To ensure your environment variables have updated ports:\n\n\t'minikube -p {{.profile_name}} docker-env'": "",
	"Please re-eval your podman-env, To ensure your environment variables have updated ports:\n\n\t'minikube -p {{.profile_name}} podman-env'": "",
	"Please see {{.documentation_url}} for more details": "",
	"Please specify the directory to be mounted: \n\tminikube mount \u003csource directory\u003e:\u003ctarget directory\u003e   (example: \"/host-home:/vm-home\")": "",
	"Please upgrade the '{{.driver_executable}}'. {{.documentation_url}}": "Actualiza \"{{.driver_executable}}\". {{.documentation_url}}",
	"Please visit the following link for documentation around this: \n\thttps://help.github.com/en/packages/using-github-packages-with-your-projects-ecosystem/configuring-docker-for-use-with-github-packages#authenticating-to-github-packages": "",
	"Populates the specified folder with documentation in markdown about minikube": "",
	"Powering off \"{{.profile_name}}\" via SSH ...": "Apagando \"{{.profile_name}}\" mediante SSH...",
	"Preparing Kubernetes {{.k8sVersion}} on {{.runtime}} {{.runtimeVersion}} ...": "Preparando Kubernetes {{.k8sVersion}} en {{.runtime}} {{.runtimeVersion}}...",
	"Print current and latest version number": "",
	"Print just the version number.": "",
	"Print the version of minikube": "",
	"Print the version of minikube.": "",
	"Problems detected in {{.entry}}:": "",
	"Problems detected in {{.name}}:": "",
	"Profile name \"{{.profilename}}\" is reserved keyword. To delete this profile, run: \"{{.cmd}}\"": "",
	"Profile name '{{.name}}' is not valid": "",
	"Profile name '{{.profilename}}' is not valid": "",
	"Provide VM UUID to restore MAC address (hyperkit driver only)": "Permite especificar un UUID de VM para restaurar la dirección MAC (solo con el controlador de hyperkit)",
	"Pulling base image ...": "",
	"Reboot to complete VirtualBox installation, verify that VirtualBox is not blocked by your system, and/or use another hypervisor": "",
	"Rebuild libvirt with virt-network support": "",
	"Received {{.name}} signal": "",
	"Registry addon on with {{.driver}} uses {{.port}} please use that instead of default 5000": "",
	"Registry mirrors to pass to the Docker daemon": "Réplicas del registro que se transferirán al daemon de Docker",
	"Reinstall VirtualBox and reboot. Alternatively, try the kvm2 driver: https://minikube.sigs.k8s.io/docs/reference/drivers/kvm2/": "",
	"Reinstall VirtualBox and verify that it is not blocked: System Preferences -\u003e Security \u0026 Privacy -\u003e General -\u003e Some system software was blocked from loading": "",
	"Related issue: {{.url}}": "",
	"Related issues:": "",
	"Relaunching Kubernetes using {{.bootstrapper}} ...": "Reiniciando Kubernetes con {{.bootstrapper}}...",
	"Remove the incompatible --docker-opt flag if one was provided": "",
	"Removed all traces of the \"{{.name}}\" cluster.": "",
	"Removing {{.directory}} ...": "Eliminando {{.directory}}...",
	"Requested cpu count {{.requested_cpus}} is less than the minimum allowed of {{.minimum_cpus}}": "",
	"Requested disk size {{.requested_size}} is less than minimum of {{.minimum_size}}": "El tamaño de disco de {{.requested_size}} que se ha solicitado es inferior al tamaño mínimo de {{.minimum_size}}",
	"Requested memory allocation ({{.memory}}MB) is less than the default memory allocation of {{.default_memorysize}}MB. Beware that minikube might not work correctly or crash unexpectedly.": "El valor de la asignación de memoria ({{.memory}} MB) solicitada es inferior a la asignación de memoria predeterminada de {{.default_memorysize}} MB. minikube podría no funcionar correctamente o fallar de manera inesperada.",
	"Requested memory allocation ({{.requested}}MB) is less than the recommended minimum {{.recommended}}MB. Kubernetes may crash unexpectedly.": "",
	"Requested memory allocation {{.requested_size}} is less than the minimum allowed of {{.minimum_size}}": "El valor de la asignación de memoria de {{.requested_size}} solicitada es inferior al valor mínimo de {{.minimum_size}}",
	"Requested memory allocation {{.requested}}MB is less than the usable minimum of {{.minimum}}MB": "",
	"Requested memory allocation {{.requested}}MB is more than your system limit {{.system_limit}}MB. Try specifying a lower memory:\n\n\tminikube start --memory={{.min_advised}}mb": "",
	"Restart Docker": "",
	"Restart Docker, Ensure docker is running and then run: 'minikube delete' and then 'minikube start' again": "",
	"Restarting existing {{.driver_name}} {{.machine_type}} for \"{{.cluster}}\" ...": "",
	"Restarting the {{.name}} service may improve performance.": "",
	"Retrieve the ssh identity key path of the specified cluster": "",
	"Retrieve the ssh identity key path of the specified cluster.": "",
	"Retrieves the IP address of the running cluster": "",
	"Retrieves the IP address of the running cluster, and writes it to STDOUT.": "",
	"Retrieves the IP address of the running cluster, checks it\n\t\t\twith IP in kubeconfig, and corrects kubeconfig if incorrect.": "",
	"Returns a URL to connect to a service": "",
	"Returns logs to debug a local Kubernetes cluster": "",
	"Returns the Kubernetes URL for a service in your local cluster. In the case of multiple URLs they will be printed one at a time.": "",
	"Returns the value of PROPERTY_NAME from the minikube config file.  Can be overwritten at runtime by flags or environmental variables.": "",
	"Right-click the PowerShell icon and select Run as Administrator to open PowerShell in elevated mode.": "",
	"Run 'kubectl describe pod coredns -n kube-system' and check for a firewall or DNS conflict": "",
	"Run 'minikube delete' to delete the stale VM, or and ensure that minikube is running as the same user you are issuing this command with": "",
	"Run 'sudo sysctl fs.protected_regular=0', or try a driver which does not require root, such as '--driver=docker'": "",
	"Run a kubectl binary matching the cluster version": "",
	"Run minikube from the C: drive.": "",
	"Run the Kubernetes client, download it if necessary. Remember -- after kubectl!\n\nExamples:\nminikube kubectl -- --help\nminikube kubectl -- get pods --namespace kube-system": "",
	"Run: 'chmod 600 $HOME/.kube/config'": "",
	"Run: 'kubectl delete clusterrolebinding kubernetes-dashboard'": "",
	"Run: 'sudo mkdir /sys/fs/cgroup/systemd \u0026\u0026 sudo mount -t cgroup -o none,name=systemd cgroup /sys/fs/cgroup/systemd'": "",
	"Running on localhost (CPUs={{.number_of_cpus}}, Memory={{.memory_size}}MB, Disk={{.disk_size}}MB) ...": "",
	"See details at https://github.com/kubernetes/minikube/issues/8861": "",
	"Service '{{.service}}' was not found in '{{.namespace}}' namespace.\nYou may select another namespace by using 'minikube service {{.service}} -n \u003cnamespace\u003e'. Or list out all the services using 'minikube service list'": "",
	"Set failed": "",
	"Set flag to delete all profiles": "",
	"Set flag to stop all profiles (clusters)": "",
	"Set this flag to delete the '.minikube' folder from your user directory.": "",
	"Sets an individual value in a minikube config file": "",
	"Sets the PROPERTY_NAME config value to PROPERTY_VALUE\n\tThese values can be overwritten by flags or environment variables at runtime.": "",
	"Sets up docker env variables; similar to '$(docker-machine env)'.": "",
	"Sets up podman env variables; similar to '$(podman-machine env)'.": "",
	"Setting profile failed": "",
	"Show a list of global command-line options (applies to all commands).": "",
	"Show only log entries which point to known problems": "",
	"Show only the most recent journal entries, and continuously print new entries as they are appended to the journal.": "",
	"Skipped switching kubectl context for {{.profile_name}} because --keep-context was set.": "",
	"Some dashboard features require the metrics-server addon. To enable all features please run:\n\n\tminikube{{.profileArg}} addons enable metrics-server": "",
	"Sorry, Kubernetes {{.k8sVersion}} requires conntrack to be installed in root's path": "",
	"Sorry, Kubernetes {{.version}} is not supported by this release of minikube. To use this version anyway, use the `--force` flag.": "",
	"Sorry, completion support is not yet implemented for {{.name}}": "",
	"Sorry, please set the --output flag to one of the following valid options: [text,json]": "",
	"Sorry, the kubeadm.{{.parameter_name}} parameter is currently not supported by --extra-config": "De momento, --extra-config no admite el parámetro kubeadm.{{.parameter_name}}",
	"Sorry, the url provided with the --registry-mirror flag is invalid: {{.url}}": "La URL proporcionada con la marca --registry-mirror no es válida: {{.url}}",
	"Specified Kubernetes version {{.specified}} is less than the oldest supported version: {{.oldest}}": "",
	"Specify --kubernetes-version in v\u003cmajor\u003e.\u003cminor.\u003cbuild\u003e form. example: 'v1.1.14'": "",
	"Specify an alternate --host-only-cidr value, such as 172.16.0.1/24": "",
	"Specify arbitrary flags to pass to the Docker daemon. (format: key=value)": "Permite indicar marcas arbitrarias que se transferirán al daemon de Docker (el formato es \"clave=valor\").",
	"Specify the 9p version that the mount should use": "",
	"Specify the ip that the mount should be setup on": "",
	"Specify the mount filesystem type (supported types: 9p)": "",
	"StartHost failed, but will try again: {{.error}}": "",
	"Starting control plane node {{.name}} in cluster {{.cluster}}": "",
	"Starting node {{.name}} in cluster {{.cluster}}": "",
	"Starting tunnel for service {{.service}}.": "",
	"Starts a local Kubernetes cluster": "",
	"Starts a local kubernetes cluster": "Inicia un clúster de Kubernetes local",
	"Starts a node.": "",
	"Starts an existing stopped node in a cluster.": "",
	"Startup with {{.old_driver}} driver failed, trying with alternate driver {{.new_driver}}: {{.error}}": "",
	"Stopping node \"{{.name}}\"  ...": "",
	"Stopping tunnel for service {{.service}}.": "",
	"Stops a local Kubernetes cluster running in Virtualbox. This command stops the VM\nitself, leaving all files intact. The cluster can be started again with the \"start\" command.": "",
	"Stops a node in a cluster.": "",
	"Stops a running local Kubernetes cluster": "",
	"Successfully added {{.name}} to {{.cluster}}!": "",
	"Successfully deleted all profiles": "",
	"Successfully mounted {{.sourcePath}} to {{.destinationPath}}": "",
	"Successfully purged minikube directory located at - [{{.minikubeDirectory}}]": "",
	"Successfully started node {{.name}}!": "",
	"Successfully stopped node {{.name}}": "",
	"Suggestion: {{.advice}}": "",
	"Suggestion: {{.fix}}": "",
	"Target directory {{.path}} must be an absolute path": "",
	"The \"{{.driver_name}}\" driver requires root privileges. Please run minikube using 'sudo -E minikube start --driver={{.driver_name}}'.": "",
	"The \"{{.driver_name}}\" driver requires root privileges. Please run minikube using 'sudo minikube --vm-driver={{.driver_name}}": "El controlador \"{{.driver_name}}\" requiere privilegios de raíz. Ejecuta minikube mediante sudo minikube --vm-driver={{.driver_name}}",
	"The \"{{.driver_name}}\" driver should not be used with root privileges.": "",
	"The \"{{.name}}\" cluster has been deleted.": "Se ha eliminado el clúster \"{{.name}}\".",
	"The \"{{.name}}\" cluster has been deleted.__1": "Se ha eliminado el clúster \"{{.name}}\".",
	"The 'none' driver is designed for experts who need to integrate with an existing VM": "",
	"The 'none' driver provides limited isolation and may reduce system security and reliability.": "La opción de controlador \"none\" proporciona un aislamiento limitado y puede reducir la seguridad y la fiabilidad del sistema.",
	"The '{{.addonName}}' addon is enabled": "",
	"The '{{.driver}}' driver requires elevated permissions. The following commands will be executed:\\n\\n{{ .example }}\\n": "",
	"The '{{.name}} driver does not support multiple profiles: https://minikube.sigs.k8s.io/docs/reference/drivers/none/": "",
	"The '{{.name}}' driver does not respect the --cpus flag": "",
	"The '{{.name}}' driver does not respect the --memory flag": "",
	"The CIDR to be used for service cluster IPs.": "El CIDR de las IP del clúster de servicio.",
	"The CIDR to be used for the minikube VM (virtualbox driver only)": "El CIDR de la VM de minikube (solo con el controlador de Virtualbox)",
	"The Docker service within '{{.name}}' is not active": "",
	"The KVM QEMU connection URI. (kvm2 driver only)": "El URI de la conexión de QEMU de la KVM (solo con el controlador de kvm2).",
	"The KVM driver is unable to resurrect this old VM. Please run `minikube delete` to delete it and try again.": "",
	"The KVM network name. (kvm2 driver only)": "El nombre de la red de KVM (solo con el controlador de kvm2).",
	"The VM driver crashed. Run 'minikube start --alsologtostderr -v=8' to see the VM driver error message": "",
	"The VM driver exited with an error, and may be corrupt. Run 'minikube start' with --alsologtostderr -v=8 to see the error": "",
	"The VM that minikube is configured for no longer exists. Run 'minikube delete'": "",
	"The apiserver listening port": "El puerto de escucha del apiserver",
	"The apiserver name which is used in the generated certificate for kubernetes. This can be used if you want to make the apiserver available from outside the machine": "El nombre del apiserver del certificado de Kubernetes generado. Se puede utilizar para que sea posible acceder al apiserver desde fuera de la máquina",
	"The argument to pass the minikube mount command on start": "El argumento para ejecutar el comando de activación de minikube durante el inicio",
	"The argument to pass the minikube mount command on start.": "",
	"The authoritative apiserver hostname for apiserver certificates and connectivity. This can be used if you want to make the apiserver available from outside the machine": "",
	"The base image to use for docker/podman drivers. Intended for local development.": "",
	"The cluster dns domain name used in the Kubernetes cluster": "",
	"The cluster dns domain name used in the kubernetes cluster": "El nombre de dominio de DNS del clúster de Kubernetes",
	"The cluster {{.cluster}} already exists which means the --nodes parameter will be ignored. Use \"minikube node add\" to add nodes to an existing cluster.": "",
	"The container runtime to be used (docker, crio, containerd)": "El entorno de ejecución del contenedor (Docker, cri-o, containerd)",
	"The control plane for \"{{.name}}\" is paused!": "",
	"The control plane node \"{{.name}}\" does not exist.": "",
	"The control plane node is not running (state={{.state}})": "",
	"The control plane node must be running for this command": "",
	"The cri socket path to be used": "La ruta del socket de cri",
	"The cri socket path to be used.": "",
	"The docker-env command is incompatible with multi-node clusters. Use the 'registry' add-on: https://minikube.sigs.k8s.io/docs/handbook/registry/": "",
	"The docker-env command is only compatible with the \"docker\" runtime, but this cluster was configured to use the \"{{.runtime}}\" runtime.": "",
	"The driver '{{.driver}}' is not supported on {{.os}}": "El controlador \"{{.driver}}\" no se puede utilizar en {{.os}}",
	"The existing \"{{.name}}\" VM was created using the \"{{.old}}\" driver, and is incompatible with the \"{{.new}}\" driver.": "",
	"The heapster addon is depreciated. please try to disable metrics-server instead": "",
	"The hyperv virtual switch name. Defaults to first found. (hyperv driver only)": "El nombre del conmutador virtual de hyperv. El valor predeterminado será el primer nombre que se encuentre (solo con el controlador de hyperv).",
	"The hypervisor does not appear to be configured properly. Run 'minikube start --alsologtostderr -v=1' and inspect the error code": "",
	"The initial time interval for each check that wait performs in seconds": "",
	"The kubernetes version that the minikube VM will use (ex: v1.2.3)": "La versión de Kubernetes que utilizará la VM de minikube (p. ej.: versión 1.2.3)",
	"The machine-driver specified is failing to start. Try running 'docker-machine-driver-\u003ctype\u003e version'": "",
	"The minikube VM is offline. Please run 'minikube start' to start it again.": "",
	"The minikube {{.driver_name}} container exited unexpectedly.": "",
	"The minimum required version for podman is \"{{.minVersion}}\". your version is \"{{.currentVersion}}\". minikube might not work. use at your own risk. To install latest version please see https://podman.io/getting-started/installation.html": "",
	"The name of the network plugin": "El nombre del complemento de red",
	"The node to check status for. Defaults to control plane. Leave blank with default format for status on all nodes.": "",
	"The node to get logs from. Defaults to the primary control plane.": "",
	"The node to ssh into. Defaults to the primary control plane.": "",
	"The node {{.name}} has ran out of available PIDs.": "",
	"The node {{.name}} has ran out of disk space.": "",
	"The node {{.name}} has ran out of memory.": "",
	"The node {{.name}} network is not available. Please verify network settings.": "",
	"The none driver is not compatible with multi-node clusters.": "",
	"The number of bytes to use for 9p packet payload": "",
	"The number of nodes to spin up. Defaults to 1.": "",
	"The output format. One of 'json', 'table'": "",
	"The path on the file system where the docs in markdown need to be saved": "",
	"The podman service within '{{.cluster}}' is not active": "",
	"The podman-env command is incompatible with multi-node clusters. Use the 'registry' add-on: https://minikube.sigs.k8s.io/docs/handbook/registry/": "",
	"The service namespace": "",
	"The service {{.service}} requires privileged ports to be exposed: {{.ports}}": "",
	"The services namespace": "",
	"The time interval for each check that wait performs in seconds": "",
	"The value passed to --format is invalid": "",
	"The value passed to --format is invalid: {{.error}}": "",
	"The vmwarefusion driver is deprecated and support for it will be removed in a future release.\n\t\t\tPlease consider switching to the new vmware unified driver, which is intended to replace the vmwarefusion driver.\n\t\t\tSee https://minikube.sigs.k8s.io/docs/reference/drivers/vmware/ for more information.\n\t\t\tTo disable this message, run [minikube config set ShowDriverDeprecationNotification false]": "",
	"The {{.driver_name}} driver should not be used with root privileges.": "El controlador {{.driver_name}} no se debe utilizar con privilegios de raíz.",
	"There is no local cluster named \"{{.cluster}}\"": "",
	"There's a new version for '{{.driver_executable}}'. Please consider upgrading. {{.documentation_url}}": "Hay una nueva versión de \"{{.driver_executable}}\". Te recomendamos que realices la actualización. {{.documentation_url}}",
	"These --extra-config parameters are invalid: {{.invalid_extra_opts}}": "",
	"These changes will take effect upon a minikube delete and then a minikube start": "",
	"This addon does not have an endpoint defined for the 'addons open' command.\nYou can add one by annotating a service with the label {{.labelName}}:{{.addonName}}": "",
	"This can also be done automatically by setting the env var CHANGE_MINIKUBE_NONE_USER=true": "El proceso se puede automatizar si se define la variable de entorno CHANGE_MINIKUBE_NONE_USER=true",
	"This control plane is not running! (state={{.state}})": "",
	"This driver does not yet work on your architecture. Maybe try --driver=none": "",
	"This is unusual - you may want to investigate using \"{{.command}}\"": "",
	"This will keep the existing kubectl context and will create a minikube context.": "Se conservará el contexto de kubectl actual y se creará uno de minikube.",
	"This will start the mount daemon and automatically mount files into minikube": "Se iniciará el daemon de activación y se activarán automáticamente los archivos en minikube",
	"This will start the mount daemon and automatically mount files into minikube.": "",
	"This {{.type}} is having trouble accessing https://{{.repository}}": "",
	"Tip: To remove this root owned cluster, run: sudo {{.cmd}}": "",
	"Tip: To remove this root owned cluster, run: sudo {{.cmd}} delete": "Para eliminar este clúster de raíz, ejecuta: sudo {{.cmd}} delete",
	"To connect to this cluster, use: kubectl --context={{.name}}": "Para conectarte a este clúster, usa: kubectl --context={{.name}}",
	"To connect to this cluster, use: kubectl --context={{.name}}__1": "Para conectarte a este clúster, usa: kubectl --context={{.name}}",
	"To connect to this cluster, use: kubectl --context={{.profile_name}}": "",
	"To disable this notice, run: 'minikube config set WantUpdateNotification false'\\n": "",
	"To fix this, run: \"{{.command}}\"": "",
	"To proceed, either:\n\n1) Delete the existing \"{{.name}}\" cluster using: '{{.delcommand}}'\n\n* or *\n\n2) Start the existing \"{{.name}}\" cluster using: '{{.command}} --driver={{.old}}'": "",
	"To pull new external images, you may need to configure a proxy: https://minikube.sigs.k8s.io/docs/reference/networking/proxy/": "",
	"To see addons list for other profiles use: `minikube addons -p name list`": "",
	"To set your Google Cloud project,  run: \n\n\t\tgcloud config set project \u003cproject name\u003e\n\nor set the GOOGLE_CLOUD_PROJECT environment variable.": "",
	"To start minikube with Hyper-V, Powershell must be in your PATH`": "",
	"To suppress and ignore this warning you can use --force flag.": "",
	"To suppress memory validations you can use --force flag.": "",
	"To track progress on multi-node clusters, see https://github.com/kubernetes/minikube/issues/7538.": "",
	"To use kubectl or minikube commands as your own user, you may need to relocate them. For example, to overwrite your own settings, run:": "Para usar comandos de kubectl o minikube como tu propio usuario, puede que debas reubicarlos. Por ejemplo, para sobrescribir tu configuración, ejecuta:",
	"Troubleshooting Commands:": "",
	"Try 'minikube delete' to force new SSL certificates to be installed": "",
	"Try 'minikube delete', and disable any conflicting VPN or firewall software": "",
	"Try specifying a --driver, or see https://minikube.sigs.k8s.io/docs/start/": "",
	"Try the solution in this link: https://github.com/kubernetes/minikube/issues/8327#issuecomment-651288459": "",
	"Trying to delete invalid profile {{.profile}}": "",
	"Unable to bind flags": "",
	"Unable to enable dashboard": "",
	"Unable to fetch latest version info": "",
	"Unable to find control plane": "",
	"Unable to generate docs": "",
	"Unable to generate the documentation. Please ensure that the path specified is a directory, exists \u0026 you have permission to write to it.": "",
	"Unable to get bootstrapper: {{.error}}": "No se ha podido obtener el programa previo: {{.error}}",
	"Unable to get command runner": "",
	"Unable to get control plane status: {{.error}}": "",
	"Unable to get current user": "",
	"Unable to get forwarded endpoint": "",
	"Unable to get machine status": "",
	"Unable to get runtime": "",
	"Unable to kill mount process: {{.error}}": "",
	"Unable to load cached images from config file.": "No se han podido cargar las imágenes almacenadas en caché del archivo de configuración.",
	"Unable to load cached images: {{.error}}": "",
	"Unable to load config: {{.error}}": "No se ha podido cargar la configuración: {{.error}}",
	"Unable to load host": "",
	"Unable to parse \"{{.kubernetes_version}}\": {{.error}}": "No se ha podido analizar la versión \"{{.kubernetes_version}}\": {{.error}}",
	"Unable to parse default Kubernetes version from constants: {{.error}}": "",
	"Unable to parse memory '{{.memory}}': {{.error}}": "",
	"Unable to parse oldest Kubernetes version from constants: {{.error}}": "",
	"Unable to pick a default driver. Here is what was considered, in preference order:": "",
	"Unable to pull images, which may be OK: {{.error}}": "No se ha podido recuperar imágenes, que podrían estar en buen estado: {{.error}}",
	"Unable to push cached images: {{.error}}": "",
	"Unable to remove machine directory": "",
	"Unable to restart cluster, will reset it: {{.error}}": "",
	"Unable to stop VM": "",
	"Unable to update {{.driver}} driver: {{.error}}": "",
	"Unfortunately, could not download the base image {{.image_name}}": "",
	"Uninstalling Kubernetes {{.kubernetes_version}} using {{.bootstrapper_name}} ...": "Desinstalando Kubernetes {{.kubernetes_version}} mediante {{.bootstrapper_name}}...",
	"Unmounting {{.path}} ...": "",
	"Unpaused {{.count}} containers": "",
	"Unpaused {{.count}} containers in: {{.namespaces}}": "",
	"Unpausing node {{.name}} ...": "",
	"Unset the KUBECONFIG environment variable, or verify that it does not point to an empty or otherwise invalid path": "",
	"Unset variables instead of setting them": "",
	"Update kubeconfig in case of an IP or port change": "",
	"Update server returned an empty list": "",
	"Updating the running {{.driver_name}} \"{{.cluster}}\" {{.machine_type}} ...": "",
	"Upgrade to QEMU v3.1.0+, run 'virt-host-validate', or ensure that you are not running in a nested VM environment.": "",
	"Upgrading from Kubernetes {{.old}} to {{.new}}": "Actualizando la versión de Kubernetes de {{.old}} a {{.new}}",
	"Usage": "",
	"Usage: minikube completion SHELL": "",
	"Usage: minikube delete": "",
	"Usage: minikube delete --all --purge": "",
	"Usage: minikube node [add|start|stop|delete|list]": "",
	"Usage: minikube node delete [name]": "",
	"Usage: minikube node list": "",
	"Usage: minikube node start [name]": "",
	"Usage: minikube node stop [name]": "",
	"Use \"{{.CommandPath}} [command] --help\" for more information about a command.": "",
	"Use 'kubect get po -A' to find the correct and namespace name": "",
	"Use -A to specify all namespaces": "",
	"Use VirtualBox to remove the conflicting VM and/or network interfaces": "",
	"Use native Golang SSH client (default true). Set to 'false' to use the command line 'ssh' command when accessing the docker machine. Useful for the machine drivers when they will not start with 'Waiting for SSH'.": "",
	"User ID:      {{.userID}}": "",
	"Userspace file server is shutdown": "",
	"Userspace file server:": "",
	"Using image repository {{.name}}": "Utilizando el repositorio de imágenes {{.name}}",
	"Using podman 2 is not supported yet. your version is \"{{.currentVersion}}\". minikube might not work. use at your own risk.": "",
	"Using the '{{.runtime}}' runtime with the 'none' driver is an untested configuration!": "",
	"Using the {{.driver}} driver based on existing profile": "",
	"Using the {{.driver}} driver based on user configuration": "",
	"VM driver is one of: %v": "El controlador de la VM es uno de los siguientes: %v",
	"Valid components are: {{.valid_extra_opts}}": "",
	"Validation unable to parse disk size '{{.diskSize}}': {{.error}}": "",
	"Verify that your HTTP_PROXY and HTTPS_PROXY environment variables are set correctly.": "",
	"Verifying Kubernetes components...": "",
	"Verifying dashboard health ...": "",
	"Verifying proxy health ...": "",
	"Verifying {{.addon_name}} addon...": "",
	"Version:      {{.version}}": "",
	"VirtualBox and Hyper-V are having a conflict. Use '--driver=hyperv' or disable Hyper-V using: 'bcdedit /set hypervisorlaunchtype off'": "",
	"VirtualBox cannot create a network, probably because it conflicts with an existing network that minikube no longer knows about. Try running 'minikube delete'": "",
	"VirtualBox is broken. Disable real-time anti-virus software, reboot, and reinstall VirtualBox if the problem continues.": "",
	"VirtualBox is broken. Reinstall VirtualBox, reboot, and run 'minikube delete'.": "",
	"VirtualBox is unable to find its network interface. Try upgrading to the latest release and rebooting.": "",
	"Virtualization support is disabled on your computer. If you are running minikube within a VM, try '--driver=docker'. Otherwise, consult your systems BIOS manual for how to enable virtualization.": "",
	"Wait failed: {{.error}}": "",
	"Wait until Kubernetes core services are healthy before exiting": "Espera hasta que los servicios principales de Kubernetes se encuentren en buen estado antes de salir",
	"Where to root the NFS Shares, defaults to /nfsshares (hyperkit driver only)": "Ruta en la raíz de los recursos compartidos de NFS. Su valor predeterminado es /nfsshares (solo con el controlador de hyperkit)",
	"Whether to use external switch over Default Switch if virtual switch not explicitly specified. (hyperv driver only)": "",
	"You appear to be using a proxy, but your NO_PROXY environment does not include the minikube IP ({{.ip_address}}).": "",
	"You appear to be using a proxy, but your NO_PROXY environment does not include the minikube IP ({{.ip_address}}). Please see {{.documentation_url}} for more details": "Parece que estás usando un proxy, pero tu entorno NO_PROXY no incluye la dirección IP de minikube ({{.ip_address}}). Consulta {{.documentation_url}} para obtener más información",
	"You are allocating {{.requested}}MB to memory and your system only has {{.system_limit}}MB. You might face issues. try specifying a lower memory:\n\n\t\tminikube start --memory={{.min_advised}}mb": "",
	"You can also use 'minikube kubectl -- get pods' to invoke a matching version": "",
	"You can delete them using the following command(s):": "",
	"You can use kubectl inside minikube. For more information, visit https://minikube.sigs.k8s.io/docs/handbook/kubectl/": "",
	"You can verify your Docker container type by running:\n{{.command}}": "",
	"You cannot change the CPUs for an existing minikube cluster. Please first delete the cluster.": "",
	"You cannot change the Disk size for an exiting minikube cluster. Please first delete the cluster.": "",
	"You cannot change the memory size for an exiting minikube cluster. Please first delete the cluster.": "",
	"You have selected Kubernetes {{.new}}, but the existing cluster is running Kubernetes {{.old}}": "",
	"You may need to manually remove the \"{{.name}}\" VM from your hypervisor": "Puede que tengas que retirar manualmente la VM \"{{.name}}\" de tu hipervisor",
	"You may need to stop the Hyper-V Manager and run `minikube delete` again.": "",
	"You must specify a service name": "",
	"Your Docker Desktop container OS type is Windows but Linux is required.": "",
	"Your Docker Desktop has less than 2 CPUs. Increase CPUs for Docker Desktop. \n\t\n\tDocker icon \u003e Settings \u003e Resources \u003e CPUs": "",
	"Your GCP credentials will now be mounted into every pod created in the {{.name}} cluster.": "",
	"Your host does not support KVM virtualization. Ensure that qemu-kvm is installed, and run 'virt-host-validate' to debug the problem": "",
	"Your host does not support virtualization. If you are running minikube within a VM, try '--driver=docker'. Otherwise, enable virtualization in your BIOS": "",
	"Your host is failing to route packets to the minikube VM. If you have VPN software, try turning it off or configuring it so that it does not re-route traffic to the VM IP. If not, check your VM environment routing options.": "",
	"Your minikube config refers to an unsupported driver. Erase ~/.minikube, and try again.": "",
	"Your minikube vm is not running, try minikube start.": "",
	"Your system has only {{.memory_amount}}MB memory. This might not work minimum required is 2000MB.": "",
	"Your system has {{.system_limit}}MB memory but Docker has only {{.container_limit}}MB. For a better performance increase to at least 3GB.\n\n\tDocker for Desktop  \u003e Settings \u003e Resources \u003e Memory": "",
	"[{{.id}}] {{.msg}} {{.error}}": "",
	"addon '{{.name}}' is currently not enabled.\nTo enable this addon run:\nminikube addons enable {{.name}}": "",
	"addon '{{.name}}' is not a valid addon packaged with minikube.\nTo see the list of available addons run:\nminikube addons list": "",
	"addons modifies minikube addons files using subcommands like \"minikube addons enable dashboard\"": "",
	"bash completion failed": "",
	"call with cleanup=true to remove old tunnels": "",
	"config modifies minikube config files using subcommands like \"minikube config set driver kvm\"\nConfigurable fields:\\n\\n": "",
	"config view failed": "",
	"dashboard service is not running: {{.error}}": "",
	"deleting node": "",
	"disable failed": "",
	"dry-run mode. Validates configuration, but does not mutate system state": "",
	"dry-run validation complete!": "",
	"enable failed": "",
	"enable metrics-server addon instead of heapster addon because heapster is deprecated": "",
	"error creating clientset": "",
	"error getting primary control plane": "",
	"error getting ssh port": "",
	"error parsing the input ip address for mount": "",
	"error provisioning host": "",
	"error starting tunnel": "",
	"error stopping tunnel": "",
	"error: --output must be 'yaml' or 'json'": "",
	"experimental": "",
	"failed to add node": "",
	"failed to open browser: {{.error}}": "",
	"failed to save config": "",
	"failed to start node": "",
	"fish completion failed": "",
	"if true, will embed the certs in kubeconfig.": "",
	"if you want to create a profile you can by this command: minikube start -p {{.profile_name}}": "",
	"initialization failed, will try again: {{.error}}": "",
	"kubeadm binary is not executable !": "",
	"kubeadm detected a TCP port conflict with another process: probably another local Kubernetes installation. Run lsof -p\u003cport\u003e to find the process and kill it": "",
	"kubectl and minikube configuration will be stored in {{.home_folder}}": "La configuración de kubectl y de minikube se almacenará en {{.home_folder}}",
	"kubectl proxy": "",
	"libmachine failed": "",
	"list displays all valid default settings for PROPERTY_NAME\nAcceptable fields:\\n\\n": "",
	"logdir set failed": "",
	"max time to wait per Kubernetes core services to be healthy.": "",
	"minikube addons list --output OUTPUT. json, list": "",
	"minikube is exiting due to an error. If the above message is not useful, open an issue:": "",
	"minikube is not yet compatible with ChromeOS": "",
	"minikube is unable to access the Google Container Registry. You may need to configure it to use a HTTP proxy.": "",
	"minikube is unable to connect to the VM: {{.error}}\n\n\tThis is likely due to one of two reasons:\n\n\t- VPN or firewall interference\n\t- {{.hypervisor}} network configuration issue\n\n\tSuggested workarounds:\n\n\t- Disable your local VPN or firewall software\n\t- Configure your local VPN or firewall to allow access to {{.ip}}\n\t- Restart or reinstall {{.hypervisor}}\n\t- Use an alternative --vm-driver\n\t- Use --force to override this connectivity check": "",
	"minikube profile was successfully set to {{.profile_name}}": "",
	"minikube provisions and manages local Kubernetes clusters optimized for development workflows.": "",
	"minikube quickly sets up a local Kubernetes cluster": "",
	"minikube status --output OUTPUT. json, text": "",
	"minikube {{.version}} is available! Download it: {{.url}}": "",
	"mkcmp is used to compare performance of two minikube binaries": "",
	"mount argument \"{{.value}}\" must be in form: \u003csource directory\u003e:\u003ctarget directory\u003e": "",
	"mount failed": "",
	"namespaces to pause": "",
	"namespaces to unpause": "",
	"none driver does not support multi-node clusters": "",
	"not enough arguments ({{.ArgCount}}).\\nusage: minikube config set PROPERTY_NAME PROPERTY_VALUE": "",
	"output layout (EXPERIMENTAL, JSON only): 'nodes' or 'cluster'": "",
	"pause Kubernetes": "",
	"profile sets the current minikube profile, or gets the current profile if no arguments are provided.  This is used to run and manage multiple minikube instance.  You can return to the default minikube profile by running `minikube profile default`": "",
	"provisioning host for node": "",
	"reload cached images.": "",
	"reloads images previously added using the 'cache add' subcommand": "",
	"retrieving node": "",
	"service {{.namespace_name}}/{{.service_name}} has no node port": "",
	"stat failed": "",
	"status json failure": "",
	"status text failure": "",
	"toom any arguments ({{.ArgCount}}).\\nusage: minikube config set PROPERTY_NAME PROPERTY_VALUE": "",
	"tunnel creates a route to services deployed with type LoadBalancer and sets their Ingress to their ClusterIP. for a detailed example see https://minikube.sigs.k8s.io/docs/tasks/loadbalancer": "",
	"unable to bind flags": "",
	"unable to delete minikube config folder": "",
	"unable to set logtostderr": "",
	"unpause Kubernetes": "",
	"unset failed": "",
	"unsets PROPERTY_NAME from the minikube config file.  Can be overwritten by flags or environmental variables": "",
	"unsets an individual value in a minikube config file": "",
	"unsupported or missing driver: {{.name}}": "",
	"update config": "",
	"usage: minikube addons configure ADDON_NAME": "",
	"usage: minikube addons disable ADDON_NAME": "",
	"usage: minikube addons enable ADDON_NAME": "",
	"usage: minikube addons list": "",
	"usage: minikube addons open ADDON_NAME": "",
	"usage: minikube config unset PROPERTY_NAME": "",
	"usage: minikube delete": "",
	"usage: minikube profile [MINIKUBE_PROFILE_NAME]": "",
	"version json failure": "",
	"version yaml failure": "",
	"zsh completion failed": "",
	"{{ .name }}: {{ .rejection }}": "",
	"{{.count}} nodes stopped.": "",
	"{{.driver_name}} \"{{.cluster}}\" {{.machine_type}} is missing, will recreate.": "",
	"{{.driver_name}} couldn't proceed because {{.driver_name}} service is not healthy.": "",
	"{{.driver_name}} has only {{.container_limit}}MB memory but you specified {{.specified_memory}}MB": "",
	"{{.driver}} does not appear to be installed": "",
	"{{.driver}} does not appear to be installed, but is specified by an existing profile. Please run 'minikube delete' or install {{.driver}}": "",
	"{{.extra_option_component_name}}.{{.key}}={{.value}}": "",
	"{{.name}} doesn't have enough CPUs.": "",
	"{{.name}} has no available configuration options": "",
	"{{.name}} is already running": "",
	"{{.name}} was successfully configured": "",
	"{{.ocibin}} is taking an unsually long time to respond, consider restarting {{.ocibin}}": "",
	"{{.path}} is version {{.client_version}}, which may be incompatible with Kubernetes {{.cluster_version}}.": "",
	"{{.prefix}}minikube {{.version}} on {{.platform}}": "{{.prefix}}minikube {{.version}} en {{.platform}}",
	"{{.type}} is not yet a supported filesystem. We will try anyways!": "",
	"{{.url}} is not accessible: {{.error}}": ""
}