{
	"\"The '{{.minikube_addon}}' addon is disabled": "Le module \"{{.minikube_addon}}\" est désactivé",
	"\"{{.context}}\" context has been updated to point to {{.hostname}}:{{.port}}": "Le contexte \"{{.context}}\" a été mis à jour pour pointer vers {{.hostname}}:{{.port}}",
	"\"{{.machineName}}\" does not exist, nothing to stop": "La machine \"{{.machineName}} n'existe pas, rien a arrêter",
	"\"{{.name}}\" profile does not exist, trying anyways.": "Le profil \"{{.name}}\" n'existe pas, tentative de suppression quand même.",
	"'none' driver does not support 'minikube docker-env' command": "Le pilote 'none' ne prend pas en charge la commande 'minikube docker-env'",
	"'none' driver does not support 'minikube mount' command": "Le pilote 'none' ne prend pas en charge la commande 'minikube mount'",
	"'none' driver does not support 'minikube podman-env' command": "Le pilote 'none' ne prend pas en charge la commande 'minikube podman-env'",
	"'none' driver does not support 'minikube ssh' command": "Le pilote 'none' ne prend pas en charge la commande 'minikube ssh'",
	"- Delete and recreate minikube cluster\n\t\tminikube delete\n\t\tminikube start --driver={{.driver_name}}": "- Supprimer et recréer le cluster de minikube\n\t\tminikube delete\n\t\tminikube start --driver={{.driver_name}}",
	"- Docs https://docs.docker.com/docker-for-mac/#resources": "- Documentation https://docs.docker.com/docker-for-mac/#resources",
	"- Docs https://docs.docker.com/docker-for-windows/#resources": "- Docs https://docs.docker.com/docker-for-windows/#resources",
	"- Ensure your {{.driver_name}} daemon has access to enough CPU/memory resources.": "- Assurez-vous que votre démon {{.driver_name}} a accès à suffisamment de ressources CPU/mémoire.",
	"- Prune unused {{.driver_name}} images, volumes and abandoned containers.": "- Nettoyer les images {{.driver_name}} non utilisées, les volumes et les conteneurs abandonnés.",
	"- Prune unused {{.driver_name}} images, volumes, networks and abandoned containers.\n\n\t\t\t\t{{.driver_name}} system prune --volumes": "",
	"- Restart your {{.driver_name}} service": "- Redémarrer votre service {{.driver_name}}",
	"A VPN or firewall is interfering with HTTP access to the minikube VM. Alternatively, try a different VM driver: https://minikube.sigs.k8s.io/docs/start/": "Un VPN ou un pare-feu interfère avec l'accès HTTP à la machine virtuelle minikube. Vous pouvez également essayer un autre pilote de machine virtuelle : https://minikube.sigs.k8s.io/docs/start/",
	"A firewall is blocking Docker the minikube VM from reaching the image repository. You may need to select --image-repository, or use a proxy.": "Un pare-feu empêche le Docker de la machine virtuelle minikube d'atteindre le dépôt d'images. Vous devriez peut-être sélectionner --image-repository, ou utiliser un proxy.",
	"A firewall is interfering with minikube's ability to make outgoing HTTPS requests. You may need to change the value of the HTTPS_PROXY environment variable.": "Un pare-feu interfère avec la capacité de minikube à executer des requêtes HTTPS sortantes. Vous devriez peut-être modifier la valeur de la variable d'environnement HTTPS_PROXY.",
	"A firewall is likely blocking minikube from reaching the internet. You may need to configure minikube to use a proxy.": "Un pare-feu empêche probablement minikube d'accéder à Internet. Vous devriez peut-être configurer minikube pour utiliser un proxy.",
	"A set of apiserver IP Addresses which are used in the generated certificate for kubernetes.  This can be used if you want to make the apiserver available from outside the machine": "Ensemble d'adresses IP apiserver qui sont utilisées dans le certificat généré pour kubernetes. Cela peut être utilisé si vous souhaitez rendre l'apiserver disponible à l'extérieur de la machine",
	"A set of apiserver IP Addresses which are used in the generated certificate for kubernetes. This can be used if you want to make the apiserver available from outside the machine": "Ensemble d'adresses IP apiserver qui sont utilisées dans le certificat généré pour kubernetes. Cela peut être utilisé si vous souhaitez rendre l'apiserver disponible à l'extérieur de la machine",
	"A set of apiserver names which are used in the generated certificate for kubernetes.  This can be used if you want to make the apiserver available from outside the machine": "Ensemble de noms de serveur d'API utilisés dans le certificat généré pour Kubernetes. Vous pouvez les utiliser si vous souhaitez que le serveur d'API soit disponible en dehors de la machine.",
	"A set of apiserver names which are used in the generated certificate for kubernetes. This can be used if you want to make the apiserver available from outside the machine": "Ensemble de noms de serveur d'API utilisés dans le certificat généré pour Kubernetes. Vous pouvez les utiliser si vous souhaitez que le serveur d'API soit disponible en dehors de la machine.",
	"A set of key=value pairs that describe configuration that may be passed to different components.\nThe key should be '.' separated, and the first part before the dot is the component to apply the configuration to.\nValid components are: kubelet, kubeadm, apiserver, controller-manager, etcd, proxy, scheduler\nValid kubeadm parameters:": "Ensemble de paires clé = valeur qui décrivent la configuration pouvant être transmise à différents composants.\nLa clé doit être séparée par le caractère \".\", la première partie placée avant le point étant le composant auquel la configuration est appliquée.\nVoici la liste des composants valides : apiserver, controller-manager, etcd, kubeadm, kubelet, proxy et scheduler.\nParamètres valides pour le composant kubeadm :",
	"A set of key=value pairs that describe feature gates for alpha/experimental features.": "Ensemble de paires clé = valeur qui décrivent l'entrée de configuration pour des fonctionnalités alpha ou expérimentales.",
	"Access the Kubernetes dashboard running within the minikube cluster": "Accéder au tableau de bord Kubernetes exécuté dans le cluster de minikube",
	"Add an image to local cache.": "Ajouter une image au cache local.",
	"Add machine IP to NO_PROXY environment variable": "Ajouter l'IP de la machine à la variable d'environnement NO_PROXY",
	"Add, delete, or push a local image into minikube": "Ajouter, supprimer ou pousser une image locale dans minikube",
	"Add, remove, or list additional nodes": "Ajouter, supprimer ou lister des nœuds supplémentaires",
	"Adding node {{.name}} to cluster {{.cluster}}": "Ajout du nœud {{.name}} au cluster {{.cluster}}",
	"Additional help topics": "Rubriques d'aide supplémentaires",
	"Additional mount options, such as cache=fscache": "Options de montage supplémentaires, telles que cache=fscache",
	"Adds a node to the given cluster config, and starts it.": "Ajoute un nœud à la configuration du cluster et démarre le cluster.",
	"Adds a node to the given cluster.": "Ajoute un nœud au cluster.",
	"Advanced Commands:": "Commandes avancées :",
	"Aliases": "Alias",
	"Allow user prompts for more information": "Autoriser les utilisateur à saisir plus d'informations",
	"Alternative image repository to pull docker images from. This can be used when you have limited access to gcr.io. Set it to \\\"auto\\\" to let minikube decide one for you. For Chinese mainland users, you may use local gcr.io mirrors such as registry.cn-hangzhou.aliyuncs.com/google_containers": "Autre dépôt d'images d'où extraire des images Docker. Il peut être utilisé en cas d'accès limité à gcr.io. Définissez-le sur \\\"auto\\\" pour permettre à minikube de choisir la valeur à votre place. Pour les utilisateurs situés en Chine continentale, vous pouvez utiliser des miroirs gcr.io locaux tels que registry.cn-hangzhou.aliyuncs.com/google_containers.",
	"Amount of RAM allocated to the minikube VM (format: \u003cnumber\u003e[\u003cunit\u003e], where unit = b, k, m or g)": "Quantité de mémoire RAM allouée à la VM minikube (format : \u003cnombre\u003e[\u003cunité\u003e], où \"unité\" = b, k, m ou g).",
	"Amount of RAM to allocate to Kubernetes (format: \u003cnumber\u003e[\u003cunit\u003e], where unit = b, k, m or g).": "Quantité de mémoire RAM à allouer à Kubernetes (format: \u003cnombre\u003e[\u003cunité\u003e], où unité = b, k, m ou g).",
	"Amount of time to wait for a service in seconds": "Temps d'attente pour un service en secondes",
	"Amount of time to wait for service in seconds": "Temps d'attente pour un service en secondes",
	"Another hypervisor, such as VirtualBox, is conflicting with KVM. Please stop the other hypervisor, or use --driver to switch to it.": "Un autre hyperviseur, tel que VirtualBox, est en conflit avec KVM. Veuillez arrêter l'autre hyperviseur ou utiliser --driver pour y basculer.",
	"Another program is using a file required by minikube. If you are using Hyper-V, try stopping the minikube VM from within the Hyper-V manager": "Un autre programme utilise un fichier requis par minikube. Si vous utilisez Hyper-V, essayez d'arrêter la machine virtuelle minikube à partir du gestionnaire Hyper-V",
	"Automatically selected the {{.driver}} driver": "Choix automatique du pilote {{.driver}}",
	"Automatically selected the {{.driver}} driver. Other choices: {{.alternates}}": "Choix automatique du pilote {{.driver}}. Autres choix: {{.alternatives}}",
	"Available Commands": "Commandes disponibles",
	"Basic Commands:": "Commandes basiques :",
	"Because you are using a Docker driver on {{.operating_system}}, the terminal needs to be open to run it.": "Comme vous utilisez un pilote Docker sur {{.operating_system}}, le terminal doit être ouvert pour l'exécuter.",
	"Bind Address: {{.Address}}": "Adresse de liaison : {{.Address}}",
	"Both driver={{.driver}} and vm-driver={{.vmd}} have been set.\n\n    Since vm-driver is deprecated, minikube will default to driver={{.driver}}.\n\n    If vm-driver is set in the global config, please run \"minikube config unset vm-driver\" to resolve this warning.\n\t\t\t": "",
	"CNI plug-in to use. Valid options: auto, bridge, calico, cilium, flannel, kindnet, or path to a CNI manifest (default: auto)": "",
	"Cannot find directory {{.path}} for mount": "",
	"Cannot use both --output and --format options": "",
	"Check if you have unnecessary pods running by running 'kubectl get po -A": "",
	"Check output of 'journalctl -xeu kubelet', try passing --extra-config=kubelet.cgroup-driver=systemd to minikube start": "",
	"Check that libvirt is setup properly": "",
	"Check that minikube is running and that you have specified the correct namespace (-n flag) if required.": "",
	"Check that the provided apiserver flags are valid, and that SELinux is disabled": "",
	"Check your firewall rules for interference, and run 'virt-host-validate' to check for KVM configuration issues. If you are running minikube within a VM, consider using --driver=none": "",
	"Choose a smaller value for --memory, such as 2000": "",
	"ChromeOS is missing the kernel support necessary for running Kubernetes": "",
	"Configuration and Management Commands:": "",
	"Configure a default route on this Linux host, or use another --driver that does not require it": "",
	"Configure an external network switch following the official documentation, then add `--hyperv-virtual-switch=\u003cswitch-name\u003e` to `minikube start`": "",
	"Configure environment to use minikube's Docker daemon": "",
	"Configure environment to use minikube's Podman service": "",
	"Configures the addon w/ADDON_NAME within minikube (example: minikube addons configure registry-creds). For a list of available addons use: minikube addons list": "",
	"Configuring environment for Kubernetes {{.k8sVersion}} on {{.runtime}} {{.runtimeVersion}}": "Configuration de l'environment pour Kubernetes {{.k8sVersion}} sur {{.runtime}} {{.runtimeVersion}}",
	"Configuring local host environment ...": "",
	"Configuring {{.name}} (Container Networking Interface) ...": "",
	"Confirm that you have a working internet connection and that your VM has not run out of resources by using: 'minikube logs'": "",
	"Confirm that you have supplied the correct value to --hyperv-virtual-switch using the 'Get-VMSwitch' command": "",
	"Connect to LoadBalancer services": "",
	"Consider creating a cluster with larger memory size using `minikube start --memory SIZE_MB` ": "",
	"Consider increasing Docker Desktop's memory size.": "",
	"Could not determine a Google Cloud project, which might be ok.": "",
	"Could not find any GCP credentials. Either run `gcloud auth application-default login` or set the GOOGLE_APPLICATION_CREDENTIALS environment variable to the path of your credentials file.": "",
	"Could not process error from failed deletion": "",
	"Could not process errors from failed deletion": "",
	"Country code of the image mirror to be used. Leave empty to use the global one. For Chinese mainland users, set it to cn.": "Code pays du miroir d'images à utiliser. Laissez ce paramètre vide pour utiliser le miroir international. Pour les utilisateurs situés en Chine continentale, définissez sa valeur sur \"cn\".",
	"Creating mount {{.name}} ...": "Création de l'installation {{.name}}…",
	"Creating {{.driver_name}} {{.machine_type}} (CPUs={{.number_of_cpus}}, Memory={{.memory_size}}MB) ...": "",
	"Creating {{.driver_name}} {{.machine_type}} (CPUs={{.number_of_cpus}}, Memory={{.memory_size}}MB, Disk={{.disk_size}}MB) ...": "Création de {{.machine_type}} {{.driver_name}} (CPUs={{.number_of_cpus}}, Mémoire={{.memory_size}}MB, Disque={{.disk_size}}MB)...",
	"Current context is \"{{.context}}\"": "",
	"DEPRECATED, use `driver` instead.": "",
	"DEPRECATED: Replaced by --cni=bridge": "",
	"Default group id used for the mount": "",
	"Default user id used for the mount": "",
	"Delete an image from the local cache.": "",
	"Deletes a local Kubernetes cluster": "",
	"Deletes a local Kubernetes cluster. This command deletes the VM, and removes all\nassociated files.": "",
	"Deletes a local kubernetes cluster. This command deletes the VM, and removes all\nassociated files.": "Supprime le cluster Kubernetes local. Cette commande supprime la VM ainsi que tous les fichiers associés.",
	"Deletes a node from a cluster.": "",
	"Deleting \"{{.profile_name}}\" in {{.driver_name}} ...": "Suppression de \"{{.profile_name}}\" dans {{.driver_name}}...",
	"Deleting container \"{{.name}}\" ...": "",
	"Deleting node {{.name}} from cluster {{.cluster}}": "Suppression de noeuds {{.name}} de cluster {{.cluster}}",
	"Disable checking for the availability of hardware virtualization before the vm is started (virtualbox driver only)": "Désactive la vérification de la disponibilité de la virtualisation du matériel avant le démarrage de la VM (pilote virtualbox uniquement).",
	"Disable dynamic memory in your VM manager, or pass in a larger --memory value": "",
	"Disables the addon w/ADDON_NAME within minikube (example: minikube addons disable dashboard). For a list of available addons use: minikube addons list ": "",
	"Disables the filesystem mounts provided by the hypervisors": "Désactive les installations de systèmes de fichiers fournies par les hyperviseurs.",
	"Disk size allocated to the minikube VM (format: \u003cnumber\u003e[\u003cunit\u003e], where unit = b, k, m or g)": "Taille de disque allouée à la VM minikube (format : \u003cnombre\u003e[\u003cunité\u003e], où \"unité\" = b, k, m ou g)",
	"Disk size allocated to the minikube VM (format: \u003cnumber\u003e[\u003cunit\u003e], where unit = b, k, m or g).": "",
	"Display dashboard URL instead of opening a browser": "",
	"Display the Kubernetes addons URL in the CLI instead of opening it in the default browser": "",
	"Display the Kubernetes service URL in the CLI instead of opening it in the default browser": "",
	"Display values currently set in the minikube config file": "",
	"Display values currently set in the minikube config file.": "",
	"Docker Desktop has less than 2 CPUs configured, but Kubernetes requires at least 2 to be available": "",
	"Docker Desktop is configured for Windows containers, but Linux containers are required for minikube": "",
	"Docker Desktop only has {{.size}}MiB available, less than the required {{.req}}MiB for Kubernetes": "",
	"Docker Desktop only has {{.size}}MiB available, you may encounter application deployment failures.": "",
	"Docker has less than 2 CPUs available, but Kubernetes requires at least 2 to be available": "",
	"Docker inside the VM is unavailable. Try running 'minikube delete' to reset the VM.": "",
	"Docs have been saved at - {{.path}}": "",
	"Documentation: {{.url}}": "",
	"Done! kubectl is now configured to use \"{{.name}}\"": "Terminé ! kubectl est maintenant configuré pour utiliser \"{{.name}}\".",
	"Done! kubectl is now configured to use \"{{.name}}\" by default": "",
	"Download complete!": "Téléchargement terminé !",
	"Downloading Kubernetes {{.version}} preload ...": "",
	"Downloading VM boot image ...": "",
	"Downloading driver {{.driver}}:": "",
	"Due to issues with CRI-O post v1.17.3, we need to restart your cluster.": "",
	"Due to networking limitations of driver {{.driver_name}} on {{.os_name}}, {{.addon_name}} addon is not supported.\nAlternatively to use this addon you can use a vm-based driver:\n\n\t'minikube start --vm=true'\n\nTo track the update on this work in progress feature please check:\nhttps://github.com/kubernetes/minikube/issues/7332": "",
	"Due to networking limitations of driver {{.driver_name}}, {{.addon_name}} addon is not supported. Try using a different driver.": "",
	"ERROR creating `registry-creds-acr` secret": "",
	"ERROR creating `registry-creds-dpr` secret": "",
	"ERROR creating `registry-creds-ecr` secret: {{.error}}": "",
	"ERROR creating `registry-creds-gcr` secret: {{.error}}": "",
	"Either systemctl is not installed, or Docker is broken. Run 'sudo systemctl start docker' and 'journalctl -u docker'": "",
	"Enable addons. see `minikube addons list` for a list of valid addon names.": "",
	"Enable experimental NVIDIA GPU support in minikube": "Active l'assistance expérimentale du GPU NVIDIA dans minikube.",
	"Enable host resolver for NAT DNS requests (virtualbox driver only)": "Active le résolveur d'hôte pour les requêtes DNS NAT (pilote VirtualBox uniquement).",
	"Enable or disable a minikube addon": "",
	"Enable proxy for NAT DNS requests (virtualbox driver only)": "Active le proxy pour les requêtes DNS NAT (pilote VirtualBox uniquement).",
	"Enable the default CNI plugin (/etc/cni/net.d/k8s.conf). Used in conjunction with \\\"--network-plugin=cni\\": "Active le plug-in CNI par défaut (/etc/cni/net.d/k8s.conf). Utilisé en association avec \\\"--network-plugin=cni\\\".",
	"Enabled addons: {{.addons}}": "",
	"Enables the addon w/ADDON_NAME within minikube (example: minikube addons enable dashboard). For a list of available addons use: minikube addons list ": "",
	"Enabling '{{.name}}' returned an error: {{.error}}": "",
	"Enabling addons: {{.addons}}": "Installation des addons: {{.addons}}",
	"Enabling dashboard ...": "",
	"Ensure that CRI-O is installed and healthy: Run 'sudo systemctl start crio' and 'journalctl -u crio'. Alternatively, use --container-runtime=docker": "",
	"Ensure that Docker is installed and healthy: Run 'sudo systemctl start docker' and 'journalctl -u docker'. Alternatively, select another value for --driver": "",
	"Ensure that the required 'pids' cgroup is enabled on your host: grep pids /proc/cgroups": "",
	"Ensure that the user listed in /etc/libvirt/qemu.conf has access to your home directory": "",
	"Ensure that your value for HTTPS_PROXY points to an HTTPS proxy rather than an HTTP proxy": "",
	"Ensure your {{.driver_name}} is running and is healthy.": "",
	"Environment variables to pass to the Docker daemon. (format: key=value)": "Variables d'environment à transmettre au daemon Docker (format : clé = valeur).",
	"Error checking driver version: {{.error}}": "Erreur lors de la vérification de la version du driver : {{.error}}",
	"Error creating minikube directory": "",
	"Error creating view template": "",
	"Error detecting shell": "",
	"Error executing view template": "",
	"Error finding port for mount": "",
	"Error generating set output": "",
	"Error generating unset output": "",
	"Error getting cluster bootstrapper": "",
	"Error getting cluster config": "",
	"Error getting host": "",
	"Error getting port binding for '{{.driver_name}} driver: {{.error}}": "",
	"Error getting primary control plane": "",
	"Error getting service with namespace: {{.namespace}} and labels {{.labelName}}:{{.addonName}}: {{.error}}": "",
	"Error getting ssh client": "",
	"Error getting the host IP address to use from within the VM": "",
	"Error killing mount process": "",
	"Error loading profile config: {{.error}}": "",
	"Error loading profile {{.name}}: {{.error}}": "Erreur lors du chargement du profil {{.name}} : {{.error}}",
	"Error opening service": "",
	"Error parsing Driver version: {{.error}}": "Erreur lors de l'analyse de la version du pilote de la VM : {{.error}}",
	"Error parsing minikube version: {{.error}}": "Erreur lors de l'analyse de la version de minikube : {{.error}}",
	"Error parsing {{.name}}={{.value}}, {{.err}}": "",
	"Error reading {{.path}}: {{.error}}": "",
	"Error starting cluster": "",
	"Error starting mount": "",
	"Error while setting kubectl current context :  {{.error}}": "",
	"Error while setting kubectl current context:  {{.error}}": "",
	"Error writing mount pid": "",
	"Error: You have selected Kubernetes v{{.new}}, but the existing cluster for your profile is running Kubernetes v{{.old}}. Non-destructive downgrades are not supported, but you can proceed by performing one of the following options:\n* Recreate the cluster using Kubernetes v{{.new}}: Run \"minikube delete {{.profile}}\", then \"minikube start {{.profile}} --kubernetes-version={{.new}}\"\n* Create a second cluster with Kubernetes v{{.new}}: Run \"minikube start -p \u003cnew name\u003e --kubernetes-version={{.new}}\"\n* Reuse the existing cluster with Kubernetes v{{.old}} or newer: Run \"minikube start {{.profile}} --kubernetes-version={{.old}}": "Erreur : Vous avez sélectionné Kubernetes v{{.new}}, mais le cluster existent pour votre profil exécute Kubernetes v{{.old}}. Les rétrogradations non-destructives ne sont pas compatibles. Toutefois, vous pouvez poursuivre le processus en réalisant l'une des trois actions suivantes :\n* Créer à nouveau le cluster en utilisant Kubernetes v{{.new}} – exécutez \"minikube delete {{.profile}}\", puis \"minikube start {{.profile}} --kubernetes-version={{.new}}\".\n* Créer un second cluster avec Kubernetes v{{.new}} – exécutez \"minikube start -p \u003cnew name\u003e --kubernetes-version={{.new}}\".\n* Réutiliser le cluster existent avec Kubernetes v{{.old}} ou version ultérieure – exécutez \"minikube start {{.profile}} --kubernetes-version={{.old}}\".",
	"Examples": "",
	"Executing \"{{.command}}\" took an unusually long time: {{.duration}}": "",
	"Existing disk is missing new features ({{.error}}). To upgrade, run 'minikube delete'": "",
	"Exiting": "Fermeture…",
	"Exiting due to {{.fatal_code}}: {{.fatal_msg}}": "",
	"External Adapter on which external switch will be created if no external switch is found. (hyperv driver only)": "",
	"Failed runtime": "",
	"Failed to cache and load images": "",
	"Failed to cache binaries": "",
	"Failed to cache images": "",
	"Failed to cache images to tar": "",
	"Failed to cache kubectl": "",
	"Failed to change permissions for {{.minikube_dir_path}}: {{.error}}": "Échec de la modification des autorisations pour {{.minikube_dir_path}} : {{.error}}",
	"Failed to check main repository and mirrors for images": "",
	"Failed to delete cluster {{.name}}, proceeding with retry anyway.": "",
	"Failed to delete cluster: {{.error}}": "Échec de la suppression du cluster : {{.error}}",
	"Failed to delete cluster: {{.error}}__1": "Échec de la suppression du cluster : {{.error}}",
	"Failed to delete images": "",
	"Failed to delete images from config": "",
	"Failed to enable container runtime": "",
	"Failed to get bootstrapper": "",
	"Failed to get command runner": "",
	"Failed to get image map": "",
	"Failed to get service URL: {{.error}}": "",
	"Failed to kill mount process: {{.error}}": "Échec de l'arrêt du processus d'installation : {{.error}}",
	"Failed to list cached images": "",
	"Failed to reload cached images": "",
	"Failed to save config {{.profile}}": "",
	"Failed to set NO_PROXY Env. Please use `export NO_PROXY=$NO_PROXY,{{.ip}}": "Échec de la définition de NO_PROXY Env. Veuillez utiliser `export NO_PROXY=$NO_PROXY,{{.ip}}.",
	"Failed to set NO_PROXY Env. Please use `export NO_PROXY=$NO_PROXY,{{.ip}}`.": "",
	"Failed to setup certs": "",
	"Failed to start {{.driver}} {{.driver_type}}. Running \"{{.cmd}}\" may fix it: {{.error}}": "",
	"Failed to stop node {{.name}}": "",
	"Failed to update cluster": "",
	"Failed to update config": "",
	"Failed to verify '{{.driver_name}} info' will try again ...": "",
	"Failed unmount: {{.error}}": "",
	"File permissions used for the mount": "",
	"Filter to use only VM Drivers": "",
	"Flags": "",
	"Follow": "",
	"For best results, install kubectl: https://kubernetes.io/docs/tasks/tools/install-kubectl/": "Pour des résultats optimaux, installez kubectl à l'adresse suivante : https://kubernetes.io/docs/tasks/tools/install-kubectl/",
	"For best results, install kubectl: https://kubernetes.io/docs/tasks/tools/install-kubectl/__1": "Pour des résultats optimaux, installez kubectl à l'adresse suivante : https://kubernetes.io/docs/tasks/tools/install-kubectl/",
	"For improved {{.driver}} performance, {{.fix}}": "",
	"For more information see: https://minikube.sigs.k8s.io/docs/drivers/{{.driver}}": "",
	"For more information, see:": "Pour en savoir plus, consultez les pages suivantes :",
	"For more information, see: https://minikube.sigs.k8s.io/docs/reference/drivers/none/": "",
	"Force environment to be configured for a specified shell: [fish, cmd, powershell, tcsh, bash, zsh], default is auto-detect": "",
	"Force minikube to perform possibly dangerous operations": "Oblige minikube à réaliser des opérations possiblement dangereuses.",
	"Format to print stdout in. Options include: [text,json]": "",
	"Found network options:": "Options de réseau trouvées :",
	"Found {{.number}} invalid profile(s) ! ": "",
	"Generate command completion for a shell": "",
	"Generate unable to parse disk size '{{.diskSize}}': {{.error}}": "",
	"Generate unable to parse memory '{{.memory}}': {{.error}}": "",
	"Get or list the current profiles (clusters)": "",
	"Gets the logs of the running instance, used for debugging minikube, not user code.": "",
	"Gets the status of a local Kubernetes cluster": "",
	"Gets the status of a local Kubernetes cluster.\n\tExit status contains the status of minikube's VM, cluster and Kubernetes encoded on it's bits in this order from right to left.\n\tEg: 7 meaning: 1 (for minikube NOK) + 2 (for cluster NOK) + 4 (for Kubernetes NOK)": "",
	"Gets the value of PROPERTY_NAME from the minikube config file": "",
	"Global Flags": "",
	"Go template format string for the cache list output.  The format for Go templates can be found here: https://golang.org/pkg/text/template/\nFor the list of accessible variables for the template, see the struct values here: https://godoc.org/k8s.io/minikube/cmd/minikube/cmd#CacheListTemplate": "",
	"Go template format string for the config view output.  The format for Go templates can be found here: https://golang.org/pkg/text/template/\nFor the list of accessible variables for the template, see the struct values here: https://godoc.org/k8s.io/minikube/cmd/minikube/cmd/config#ConfigViewTemplate": "",
	"Go template format string for the status output.  The format for Go templates can be found here: https://golang.org/pkg/text/template/\nFor the list accessible variables for the template, see the struct values here: https://godoc.org/k8s.io/minikube/cmd/minikube/cmd#Status": "",
	"Group ID:     {{.groupID}}": "",
	"Hide the hypervisor signature from the guest in minikube (kvm2 driver only)": "Masque la signature de l'hyperviseur de l'invité dans minikube (pilote kvm2 uniquement).",
	"Hyperkit is broken. Upgrade to the latest hyperkit version and/or Docker for Desktop. Alternatively, you may choose an alternate --driver": "",
	"Hyperkit networking is broken. Upgrade to the latest hyperkit version and/or Docker for Desktop. Alternatively, you may choose an alternate --driver": "",
	"If set, automatically updates drivers to the latest version. Defaults to true.": "",
	"If set, delete the current cluster if start fails and try again. Defaults to false.": "",
	"If set, download tarball of preloaded images if available to improve start time. Defaults to true.": "",
	"If set, force the container runtime to use sytemd as cgroup manager. Currently available for docker and crio. Defaults to false.": "",
	"If set, install addons. Defaults to true.": "",
	"If set, pause all namespaces": "",
	"If set, unpause all namespaces": "",
	"If the above advice does not help, please let us know: ": "",
	"If true, cache docker images for the current bootstrapper and load them into the machine. Always false with --driver=none.": "",
	"If true, cache docker images for the current bootstrapper and load them into the machine. Always false with --vm-driver=none.": "Si la valeur est \"true\", mettez les images Docker en cache pour l'amorceur actuel et chargez-les dans la machine. La valeur est toujours \"false\" avec --vm-driver=none.",
	"If true, only download and cache files for later use - don't install or start anything.": "Si la valeur est \"true\", téléchargez les fichiers et mettez-les en cache uniquement pour une utilisation future. Ne lancez pas d'installation et ne commencez aucun processus.",
	"If true, the added node will be marked for work. Defaults to true.": "",
	"If true, the node added will also be a control plane in addition to a worker.": "",
	"If you are running minikube within a VM, consider using --driver=none:": "",
	"If you are still interested to make {{.driver_name}} driver work. The following suggestions might help you get passed this issue:": "",
	"If you don't want your credentials mounted into a specific pod, add a label with the `gcp-auth-skip-secret` key to your pod configuration.": "",
	"Images Commands:": "",
	"In order to use the fall back image, you need to log in to the github packages registry": "",
	"Insecure Docker registries to pass to the Docker daemon.  The default service CIDR range will automatically be added.": "",
	"Insecure Docker registries to pass to the Docker daemon. The default service CIDR range will automatically be added.": "Registres Docker non sécurisés à transmettre au daemon Docker. La plage CIDR par défaut du service sera ajoutée automatiquement.",
	"Install VirtualBox and ensure it is in the path, or select an alternative value for --driver": "",
	"Install the latest hyperkit binary, and run 'minikube delete'": "",
	"Invalid Container Runtime: \"{{.runtime}}\". Valid runtimes are: {{.validOptions}}": "",
	"Istio needs {{.minCPUs}} CPUs -- your configuration only allocates {{.cpus}} CPUs": "",
	"Istio needs {{.minMem}}MB of memory -- your configuration only allocates {{.memory}}MB": "",
	"Kill the mount process spawned by minikube start": "",
	"Kubelet network plug-in to use (default: auto)": "",
	"Kubernetes requires at least 2 CPU's to start": "",
	"Kubernetes {{.new}} is now available. If you would like to upgrade, specify: --kubernetes-version={{.prefix}}{{.new}}": "",
	"Kubernetes {{.version}} is not supported by this release of minikube": "",
	"Launching Kubernetes ...": "Lancement de Kubernetes...",
	"Launching proxy ...": "",
	"List all available images from the local cache.": "",
	"List existing minikube nodes.": "",
	"List nodes.": "",
	"List of guest VSock ports that should be exposed as sockets on the host (hyperkit driver only)": "Liste de ports VSock invités qui devraient être exposés comme sockets sur l'hôte (pilote hyperkit uniquement).",
	"List of ports that should be exposed (docker and podman driver only)": "",
	"Lists all available minikube addons as well as their current statuses (enabled/disabled)": "",
	"Lists all minikube profiles.": "",
	"Lists all valid default values for PROPERTY_NAME": "",
	"Lists all valid minikube profiles and detects all possible invalid profiles.": "",
	"Lists the URLs for the services in your local cluster": "",
	"Local folders to share with Guest via NFS mounts (hyperkit driver only)": "Dossiers locaux à partager avec l'invité par des installations NFS (pilote hyperkit uniquement).",
	"Local proxy ignored: not passing {{.name}}={{.value}} to docker env.": "",
	"Location of the VPNKit socket used for networking. If empty, disables Hyperkit VPNKitSock, if 'auto' uses Docker for Mac VPNKit connection, otherwise uses the specified VSock (hyperkit driver only)": "Emplacement du socket VPNKit exploité pour la mise en réseau. Si la valeur est vide, désactive Hyperkit VPNKitSock. Si la valeur affiche \"auto\", utilise la connexion VPNKit de Docker pour Mac. Sinon, utilise le VSock spécifié (pilote hyperkit uniquement).",
	"Location of the minikube iso": "Emplacement de l'ISO minikube.",
	"Locations to fetch the minikube ISO from.": "",
	"Log into or run a command on a machine with SSH; similar to 'docker-machine ssh'.": "",
	"Log into the minikube environment (for debugging)": "",
	"Message Size: {{.size}}": "",
	"Modify persistent configuration values": "",
	"Most users should use the newer 'docker' driver instead, which does not require root!": "",
	"Mount type:   {{.name}}": "",
	"Mounting host path {{.sourcePath}} into VM as {{.destinationPath}} ...": "",
	"Mounts the specified directory into minikube": "",
	"Mounts the specified directory into minikube.": "",
	"Multi-node clusters are currently experimental and might exhibit unintended behavior.": "",
	"Multiple errors deleting profiles": "",
	"Multiple minikube profiles were found - ": "",
	"NIC Type used for host only network. One of Am79C970A, Am79C973, 82540EM, 82543GC, 82545EM, or virtio (virtualbox driver only)": "",
	"NIC Type used for nat network. One of Am79C970A, Am79C973, 82540EM, 82543GC, 82545EM, or virtio (virtualbox driver only)": "",
	"NOTE: This process must stay alive for the mount to be accessible ...": "",
	"Networking and Connectivity Commands:": "",
	"No changes required for the \"{{.context}}\" context": "",
	"No minikube profile was found. You can create one using `minikube start`.": "",
	"No possible driver was detected. Try specifying --driver, or see https://minikube.sigs.k8s.io/docs/start/": "",
	"Node \"{{.node_name}}\" stopped.": "Le noeud \"{{.node_name}}\" est arrêté.",
	"Node {{.name}} failed to start, deleting and trying again.": "",
	"Node {{.name}} was successfully deleted.": "",
	"Node {{.nodeName}} does not exist.": "",
	"None of the known repositories are accessible. Consider specifying an alternative image repository with --image-repository flag": "",
	"None of the known repositories in your location are accessible. Using {{.image_repository_name}} as fallback.": "Aucun dépôt connu dans votre emplacement n'est accessible. {{.image_repository_name}} est utilisé comme dépôt de remplacement.",
	"None of the known repositories is accessible. Consider specifying an alternative image repository with --image-repository flag": "Aucun dépôt connu n'est accessible. Pensez à spécifier un autre dépôt d'images à l'aide de l'indicateur \"--image-repository\".",
	"Noticed you have an activated docker-env on {{.driver_name}} driver in this terminal:": "",
	"Noticed you have an activated podman-env on {{.driver_name}} driver in this terminal:": "",
	"Number of CPUs allocated to Kubernetes.": "",
	"Number of CPUs allocated to the minikube VM": "Nombre de processeurs alloués à la VM minikube.",
	"Number of lines back to go within the log": "",
	"OS release is {{.pretty_name}}": "",
	"One of 'yaml' or 'json'.": "",
	"Only alphanumeric and dashes '-' are permitted. Minimum 1 character, starting with alphanumeric.": "",
	"Only alphanumeric and dashes '-' are permitted. Minimum 2 characters, starting with alphanumeric.": "",
	"Open the addons URL with https instead of http": "",
	"Open the service URL with https instead of http (defaults to \\\"false\\\")": "",
	"Opening Kubernetes service  {{.namespace_name}}/{{.service_name}} in default browser...": "",
	"Opening service {{.namespace_name}}/{{.service_name}} in default browser...": "",
	"Opening {{.url}} in your default browser...": "",
	"Opens the addon w/ADDON_NAME within minikube (example: minikube addons open dashboard). For a list of available addons use: minikube addons list ": "",
	"Operations on nodes": "",
	"Options:      {{.options}}": "",
	"Output format. Accepted values: [json]": "",
	"Outputs minikube shell completion for the given shell (bash, zsh or fish)\n\n\tThis depends on the bash-completion binary.  Example installation instructions:\n\tOS X:\n\t\t$ brew install bash-completion\n\t\t$ source $(brew --prefix)/etc/bash_completion\n\t\t$ minikube completion bash \u003e ~/.minikube-completion  # for bash users\n\t\t$ minikube completion zsh \u003e ~/.minikube-completion  # for zsh users\n\t\t$ source ~/.minikube-completion\n\t\t$ minikube completion fish \u003e ~/.config/fish/completions/minikube.fish # for fish users\n\tUbuntu:\n\t\t$ apt-get install bash-completion\n\t\t$ source /etc/bash-completion\n\t\t$ source \u003c(minikube completion bash) # for bash users\n\t\t$ source \u003c(minikube completion zsh) # for zsh users\n\t\t$ minikube completion fish \u003e ~/.config/fish/completions/minikube.fish # for fish users\n\n\tAdditionally, you may want to output the completion to a file and source in your .bashrc\n\n\tNote for zsh users: [1] zsh completions are only supported in versions of zsh \u003e= 5.2\n\tNote for fish users: [2] please refer to this docs for more details https://fishshell.com/docs/current/#tab-completion\n": "",
	"Pause": "",
	"Paused {{.count}} containers": "",
	"Paused {{.count}} containers in: {{.namespaces}}": "",
	"Pausing node {{.name}} ... ": "",
	"Permissions:  {{.octalMode}} ({{.writtenMode}})": "",
	"Please create a cluster with bigger disk size: `minikube start --disk SIZE_MB` ": "",
	"Please either authenticate to the registry or use --base-image flag to use a different registry.": "",
	"Please enter a value:": "",
	"Please free up disk or prune images.": "",
	"Please increse Desktop's disk size.": "",
	"Please install the minikube hyperkit VM driver, or select an alternative --driver": "",
	"Please install the minikube kvm2 VM driver, or select an alternative --driver": "",
	"Please make sure the service you are looking for is deployed or is in the correct namespace.": "",
	"Please re-eval your docker-env, To ensure your environment variables have updated ports:\n\n\t'minikube -p {{.profile_name}} docker-env'\n\n\t": "",
	"Please re-eval your podman-env, To ensure your environment variables have updated ports:\n\n\t'minikube -p {{.profile_name}} podman-env'\n\n\t": "",
	"Please see {{.documentation_url}} for more details": "",
	"Please specify the directory to be mounted: \n\tminikube mount \u003csource directory\u003e:\u003ctarget directory\u003e   (example: \"/host-home:/vm-home\")": "",
	"Please upgrade the '{{.driver_executable}}'. {{.documentation_url}}": "Veuillez mettre à niveau l'exécutable \"{{.driver_executable}}\". {{.documentation_url}}",
	"Please visit the following link for documentation around this: \n\thttps://help.github.com/en/packages/using-github-packages-with-your-projects-ecosystem/configuring-docker-for-use-with-github-packages#authenticating-to-github-packages\n": "",
	"Populates the specified folder with documentation in markdown about minikube": "",
	"PowerShell is running in constrained mode, which is incompatible with Hyper-V scripting.": "",
	"Powering off \"{{.profile_name}}\" via SSH ...": "Mise hors tension du profil \"{{.profile_name}}\" via SSH…",
	"Preparing Kubernetes {{.k8sVersion}} on {{.runtime}} {{.runtimeVersion}} ...": "Préparation de Kubernetes {{.k8sVersion}} sur {{.runtime}} {{.runtimeVersion}}...",
	"Print current and latest version number": "",
	"Print just the version number.": "",
	"Print the version of minikube": "",
	"Print the version of minikube.": "",
	"Problems detected in {{.entry}}:": "",
	"Problems detected in {{.name}}:": "",
	"Profile \"{{.cluster}}\" not found. Run \"minikube profile list\" to view all profiles.": "",
	"Profile name \"{{.profilename}}\" is reserved keyword. To delete this profile, run: \"{{.cmd}}\"": "",
	"Profile name '{{.name}}' is not valid": "",
	"Profile name '{{.profilename}}' is not valid": "",
	"Provide VM UUID to restore MAC address (hyperkit driver only)": "Fournit l'identifiant unique universel (UUID) de la VM pour restaurer l'adresse MAC (pilote hyperkit uniquement).",
	"Pulling base image ...": "",
	"Pulling images ...": "Extraction des images... ",
	"Reboot to complete VirtualBox installation, verify that VirtualBox is not blocked by your system, and/or use another hypervisor": "",
	"Rebuild libvirt with virt-network support": "",
	"Received {{.name}} signal": "",
	"Registry addon on with {{.driver}} uses {{.port}} please use that instead of default 5000": "",
	"Registry mirrors to pass to the Docker daemon": "Miroirs de dépôt à transmettre au daemon Docker.",
	"Reinstall VirtualBox and reboot. Alternatively, try the kvm2 driver: https://minikube.sigs.k8s.io/docs/reference/drivers/kvm2/": "",
	"Reinstall VirtualBox and verify that it is not blocked: System Preferences -\u003e Security \u0026 Privacy -\u003e General -\u003e Some system software was blocked from loading": "",
	"Related issue: {{.url}}": "",
	"Related issues:": "",
	"Relaunching Kubernetes using {{.bootstrapper}} ...": "Redémarrage de Kubernetes à l'aide de {{.bootstrapper}}…",
	"Remove the invalid --docker-opt or --insecure-registry flag if one was provided": "",
	"Removed all traces of the \"{{.name}}\" cluster.": "Le cluster \"{{.name}}\" a été supprimé.",
	"Removing {{.directory}} ...": "Suppression du répertoire {{.directory}}…",
	"Requested cpu count {{.requested_cpus}} is less than the minimum allowed of {{.minimum_cpus}}": "",
	"Requested disk size {{.requested_size}} is less than minimum of {{.minimum_size}}": "La taille de disque demandée ({{.requested_size}}) est inférieure à la taille minimale ({{.minimum_size}}).",
	"Requested memory allocation ({{.memory}}MB) is less than the default memory allocation of {{.default_memorysize}}MB. Beware that minikube might not work correctly or crash unexpectedly.": "L'allocation de mémoire demandée ({{.memory}} Mo) est inférieure à l'allocation de mémoire par défaut ({{.default_memorysize}} Mo). Sachez que minikube pourrait ne pas fonctionner correctement ou planter de manière inattendue.",
	"Requested memory allocation ({{.requested}}MB) is less than the recommended minimum {{.recommend}}MB. Deployments may fail.": "",
	"Requested memory allocation {{.requested_size}} is less than the minimum allowed of {{.minimum_size}}": "L'allocation de mémoire demandée ({{.requested_size}}) est inférieure au minimum autorisé ({{.minimum_size}}).",
	"Requested memory allocation {{.requested}}MB is more than your system limit {{.system_limit}}MB.": "",
	"Requested memory allocation {{.requested}}MiB is less than the usable minimum of {{.minimum_memory}}MB": "",
	"Reset Docker to factory defaults": "",
	"Restart Docker": "",
	"Restart Docker, Ensure docker is running and then run: 'minikube delete' and then 'minikube start' again": "",
	"Restarting existing {{.driver_name}} {{.machine_type}} for \"{{.cluster}}\" ...": "",
	"Restarting the {{.name}} service may improve performance.": "",
	"Retrieve the ssh identity key path of the specified cluster": "",
	"Retrieve the ssh identity key path of the specified cluster.": "",
	"Retrieves the IP address of the running cluster": "",
	"Retrieves the IP address of the running cluster, and writes it to STDOUT.": "",
	"Retrieves the IP address of the running cluster, checks it\n\t\t\twith IP in kubeconfig, and corrects kubeconfig if incorrect.": "",
	"Returns a URL to connect to a service": "",
	"Returns logs to debug a local Kubernetes cluster": "",
	"Returns the Kubernetes URL for a service in your local cluster. In the case of multiple URLs they will be printed one at a time.": "",
	"Returns the value of PROPERTY_NAME from the minikube config file.  Can be overwritten at runtime by flags or environmental variables.": "",
	"Right-click the PowerShell icon and select Run as Administrator to open PowerShell in elevated mode.": "",
	"Run 'kubectl describe pod coredns -n kube-system' and check for a firewall or DNS conflict": "",
	"Run 'minikube delete' to delete the stale VM, or and ensure that minikube is running as the same user you are issuing this command with": "",
	"Run 'sudo sysctl fs.protected_regular=0', or try a driver which does not require root, such as '--driver=docker'": "",
	"Run a kubectl binary matching the cluster version": "",
	"Run minikube from the C: drive.": "",
	"Run the Kubernetes client, download it if necessary. Remember -- after kubectl!\n\nExamples:\nminikube kubectl -- --help\nminikube kubectl -- get pods --namespace kube-system": "",
	"Run: 'Enable-WindowsOptionalFeature -Online -FeatureName Microsoft-Hyper-V-Tools-All'": "",
	"Run: 'kubectl delete clusterrolebinding kubernetes-dashboard'": "",
	"Run: 'sudo chown $USER $HOME/.kube/config \u0026\u0026 chmod 600 $HOME/.kube/config'": "",
	"Run: 'sudo mkdir /sys/fs/cgroup/systemd \u0026\u0026 sudo mount -t cgroup -o none,name=systemd cgroup /sys/fs/cgroup/systemd'": "",
	"Running on localhost (CPUs={{.number_of_cpus}}, Memory={{.memory_size}}MB, Disk={{.disk_size}}MB) ...": "",
	"See details at https://github.com/kubernetes/minikube/issues/8861": "",
	"Select a valid value for --dnsdomain": "",
	"Service '{{.service}}' was not found in '{{.namespace}}' namespace.\nYou may select another namespace by using 'minikube service {{.service}} -n \u003cnamespace\u003e'. Or list out all the services using 'minikube service list'": "",
	"Set failed": "",
	"Set flag to delete all profiles": "",
	"Set flag to stop all profiles (clusters)": "",
	"Set this flag to delete the '.minikube' folder from your user directory.": "",
	"Sets an individual value in a minikube config file": "",
	"Sets the PROPERTY_NAME config value to PROPERTY_VALUE\n\tThese values can be overwritten by flags or environment variables at runtime.": "",
	"Sets up docker env variables; similar to '$(docker-machine env)'.": "",
	"Sets up podman env variables; similar to '$(podman-machine env)'.": "",
	"Setting profile failed": "",
	"Show a list of global command-line options (applies to all commands).": "",
	"Show only log entries which point to known problems": "",
	"Show only the most recent journal entries, and continuously print new entries as they are appended to the journal.": "",
	"Skipped switching kubectl context for {{.profile_name}} because --keep-context was set.": "",
	"Some dashboard features require the metrics-server addon. To enable all features please run:\n\n\tminikube{{.profileArg}} addons enable metrics-server\t\n\n": "",
	"Sorry, Kubernetes {{.k8sVersion}} requires conntrack to be installed in root's path": "",
	"Sorry, completion support is not yet implemented for {{.name}}": "",
	"Sorry, please set the --output flag to one of the following valid options: [text,json]": "",
	"Sorry, the kubeadm.{{.parameter_name}} parameter is currently not supported by --extra-config": "Désolé, le paramètre kubeadm.{{.parameter_name}} ne peut actuellement pas être utilisé avec \"--extra-config\".",
	"Sorry, the url provided with the --registry-mirror flag is invalid: {{.url}}": "Désolé, l'URL fournie avec l'indicateur \"--registry-mirror\" n'est pas valide : {{.url}}",
	"Sorry, {{.driver}} does not allow mounts to be changed after container creation (previous mount: '{{.old}}', new mount: '{{.new}})'": "",
	"Specified Kubernetes version {{.specified}} is less than the oldest supported version: {{.oldest}}": "",
	"Specify --kubernetes-version in v\u003cmajor\u003e.\u003cminor.\u003cbuild\u003e form. example: 'v1.1.14'": "",
	"Specify an alternate --host-only-cidr value, such as 172.16.0.1/24": "",
	"Specify arbitrary flags to pass to the Docker daemon. (format: key=value)": "Spécifie des indicateurs arbitraires à transmettre au daemon Docker (format : clé = valeur).",
	"Specify the 9p version that the mount should use": "",
	"Specify the ip that the mount should be setup on": "",
	"Specify the mount filesystem type (supported types: 9p)": "",
	"StartHost failed, but will try again: {{.error}}": "",
	"Starting control plane node {{.name}} in cluster {{.cluster}}": "Démarrage du noeud de plan de contrôle {{.name}} dans le cluster {{.cluster}}",
	"Starting node {{.name}} in cluster {{.cluster}}": "Démarrage du noeud {{.name}} dans le cluster {{.cluster}}",
	"Starting tunnel for service {{.service}}.": "",
	"Starts a local Kubernetes cluster": "",
	"Starts a local kubernetes cluster": "Démarre un cluster Kubernetes local.",
	"Starts a node.": "",
	"Starts an existing stopped node in a cluster.": "",
	"Startup with {{.old_driver}} driver failed, trying with alternate driver {{.new_driver}}: {{.error}}": "",
	"Stopping \"{{.profile_name}}\" in {{.driver_name}} ...": "Arrêt de \"{{.profile_name}}\" sur {{.driver_name}}...",
	"Stopping node \"{{.name}}\"  ...": "",
	"Stopping tunnel for service {{.service}}.": "",
	"Stops a local Kubernetes cluster. This command stops the underlying VM or container, but keeps user data intact. The cluster can be started again with the \"start\" command.": "",
	"Stops a node in a cluster.": "",
	"Stops a running local Kubernetes cluster": "",
	"Successfully added {{.name}} to {{.cluster}}!": "",
	"Successfully deleted all profiles": "",
	"Successfully mounted {{.sourcePath}} to {{.destinationPath}}": "",
	"Successfully purged minikube directory located at - [{{.minikubeDirectory}}]": "",
	"Successfully started node {{.name}}!": "",
	"Successfully stopped node {{.name}}": "",
	"Suggestion: {{.advice}}": "",
	"System only has {{.size}}MiB available, less than the required {{.req}}MiB for Kubernetes": "",
	"Target directory {{.path}} must be an absolute path": "",
	"The \"{{.driver_name}}\" driver requires root privileges. Please run minikube using 'sudo -E minikube start --driver={{.driver_name}}'.": "",
	"The \"{{.driver_name}}\" driver requires root privileges. Please run minikube using 'sudo minikube --vm-driver={{.driver_name}}": "Le pilote \"{{.driver_name}}\" nécessite de disposer de droits racine. Veuillez exécuter minikube à l'aide de \"sudo minikube --vm-driver={{.driver_name}}\".",
	"The \"{{.driver_name}}\" driver should not be used with root privileges.": "",
	"The 'none' driver is designed for experts who need to integrate with an existing VM": "",
	"The 'none' driver provides limited isolation and may reduce system security and reliability.": "L'isolation fournie par le pilote \"none\" (aucun) est limitée, ce qui peut diminuer la sécurité et la fiabilité du système.",
	"The '{{.addonName}}' addon is enabled": "",
	"The '{{.driver}}' driver requires elevated permissions. The following commands will be executed:\\n\\n{{ .example }}\\n": "",
	"The '{{.driver}}' provider was not found: {{.error}}": "",
	"The '{{.name}} driver does not support multiple profiles: https://minikube.sigs.k8s.io/docs/reference/drivers/none/": "",
	"The '{{.name}}' driver does not respect the --cpus flag": "",
	"The '{{.name}}' driver does not respect the --memory flag": "",
	"The CIDR to be used for service cluster IPs.": "Méthode CIDR à exploiter pour les adresses IP des clusters du service.",
	"The CIDR to be used for the minikube VM (virtualbox driver only)": "Méthode CIDR à exploiter pour la VM minikube (pilote virtualbox uniquement).",
	"The Docker service within '{{.name}}' is not active": "",
	"The KVM QEMU connection URI. (kvm2 driver only)": "URI de connexion QEMU de la KVM (pilote kvm2 uniquement).",
	"The KVM driver is unable to resurrect this old VM. Please run `minikube delete` to delete it and try again.": "",
	"The KVM network name. (kvm2 driver only)": "Nom du réseau de la KVM (pilote kvm2 uniquement).",
	"The VM driver crashed. Run 'minikube start --alsologtostderr -v=8' to see the VM driver error message": "",
	"The VM driver exited with an error, and may be corrupt. Run 'minikube start' with --alsologtostderr -v=8 to see the error": "",
	"The VM that minikube is configured for no longer exists. Run 'minikube delete'": "",
	"The apiserver listening port": "Port d'écoute du serveur d'API.",
	"The apiserver name which is used in the generated certificate for kubernetes. This can be used if you want to make the apiserver available from outside the machine": "Nom du serveur d'API utilisé dans le certificat généré pour Kubernetes. Vous pouvez l'utiliser si vous souhaitez que le serveur d'API soit disponible en dehors de la machine.",
	"The argument to pass the minikube mount command on start": "Argument à transmettre à la commande d'installation de minikube au démarrage.",
	"The argument to pass the minikube mount command on start.": "",
	"The authoritative apiserver hostname for apiserver certificates and connectivity. This can be used if you want to make the apiserver available from outside the machine": "",
	"The base image to use for docker/podman drivers. Intended for local development.": "",
	"The certificate hostname provided appears to be invalid (may be a minikube bug, try 'minikube delete')": "",
	"The cluster dns domain name used in the Kubernetes cluster": "",
	"The cluster dns domain name used in the kubernetes cluster": "Nom du domaine DNS du cluster utilisé dans le cluster Kubernetes.",
	"The cluster {{.cluster}} already exists which means the --nodes parameter will be ignored. Use \"minikube node add\" to add nodes to an existing cluster.": "",
	"The container runtime to be used (docker, crio, containerd)": "environment d'exécution du conteneur à utiliser (docker, crio, containerd).",
	"The control plane for \"{{.name}}\" is paused!": "",
	"The control plane node \"{{.name}}\" does not exist.": "",
	"The control plane node is not running (state={{.state}})": "",
	"The control plane node must be running for this command": "",
	"The cri socket path to be used": "Chemin d'accès au socket CRI à utiliser.",
	"The cri socket path to be used.": "",
	"The docker-env command is incompatible with multi-node clusters. Use the 'registry' add-on: https://minikube.sigs.k8s.io/docs/handbook/registry/": "",
	"The docker-env command is only compatible with the \"docker\" runtime, but this cluster was configured to use the \"{{.runtime}}\" runtime.": "",
	"The driver '{{.driver}}' is not supported on {{.os}}/{{.arch}}": "Le pilote \"{{.driver}}\" n'est pas compatible avec {{.os}}/{{.arch}}.",
	"The existing \"{{.name}}\" cluster was created using the \"{{.old}}\" driver, which is incompatible with requested \"{{.new}}\" driver.": "",
	"The existing node configuration appears to be corrupt. Run 'minikube delete'": "",
	"The heapster addon is depreciated. please try to disable metrics-server instead": "",
	"The hyperv virtual switch name. Defaults to first found. (hyperv driver only)": "Nom du commutateur virtuel hyperv. La valeur par défaut affiche le premier commutateur trouvé (pilote hyperv uniquement).",
	"The hypervisor does not appear to be configured properly. Run 'minikube start --alsologtostderr -v=1' and inspect the error code": "",
	"The initial time interval for each check that wait performs in seconds": "",
	"The kubeadm binary within the Docker container is not executable": "",
	"The kubernetes version that the minikube VM will use (ex: v1.2.3)": "Version de Kubernetes qu'utilisera la VM minikube (exemple : v1.2.3).",
	"The machine-driver specified is failing to start. Try running 'docker-machine-driver-\u003ctype\u003e version'": "",
	"The minikube VM is offline. Please run 'minikube start' to start it again.": "",
	"The minikube {{.driver_name}} container exited unexpectedly.": "",
	"The minimum required version for podman is \"{{.minVersion}}\". your version is \"{{.currentVersion}}\". minikube might not work. use at your own risk. To install latest version please see https://podman.io/getting-started/installation.html": "",
	"The name of the network plugin": "Nom du plug-in réseau.",
	"The node to check status for. Defaults to control plane. Leave blank with default format for status on all nodes.": "",
	"The node to get logs from. Defaults to the primary control plane.": "",
	"The node to ssh into. Defaults to the primary control plane.": "",
	"The node {{.name}} has ran out of available PIDs.": "",
	"The node {{.name}} has ran out of disk space.": "",
	"The node {{.name}} has ran out of memory.": "",
	"The node {{.name}} network is not available. Please verify network settings.": "",
	"The none driver is not compatible with multi-node clusters.": "",
	"The number of bytes to use for 9p packet payload": "",
	"The number of nodes to spin up. Defaults to 1.": "",
	"The output format. One of 'json', 'table'": "",
	"The path on the file system where the docs in markdown need to be saved": "",
	"The podman service within '{{.cluster}}' is not active": "",
	"The podman-env command is incompatible with multi-node clusters. Use the 'registry' add-on: https://minikube.sigs.k8s.io/docs/handbook/registry/": "",
	"The requested memory allocation of {{.requested}}MiB does not leave room for system overhead (total system memory: {{.system_limit}}MiB). You may face stability issues.": "",
	"The service namespace": "",
	"The service {{.service}} requires privileged ports to be exposed: {{.ports}}": "",
	"The services namespace": "",
	"The time interval for each check that wait performs in seconds": "",
	"The value passed to --format is invalid": "",
	"The value passed to --format is invalid: {{.error}}": "",
	"The vmwarefusion driver is deprecated and support for it will be removed in a future release.\n\t\t\tPlease consider switching to the new vmware unified driver, which is intended to replace the vmwarefusion driver.\n\t\t\tSee https://minikube.sigs.k8s.io/docs/reference/drivers/vmware/ for more information.\n\t\t\tTo disable this message, run [minikube config set ShowDriverDeprecationNotification false]": "",
	"The {{.driver_name}} driver should not be used with root privileges.": "Le pilote {{.driver_name}} ne doit pas être utilisé avec des droits racine.",
	"There's a new version for '{{.driver_executable}}'. Please consider upgrading. {{.documentation_url}}": "Une nouvelle version de \"{{.driver_executable}}\" est disponible. Pensez à effectuer la mise à niveau. {{.documentation_url}}",
	"These --extra-config parameters are invalid: {{.invalid_extra_opts}}": "",
	"These changes will take effect upon a minikube delete and then a minikube start": "",
	"This addon does not have an endpoint defined for the 'addons open' command.\nYou can add one by annotating a service with the label {{.labelName}}:{{.addonName}}": "",
	"This can also be done automatically by setting the env var CHANGE_MINIKUBE_NONE_USER=true": "Cette opération peut également être réalisée en définissant la variable d'environment \"CHANGE_MINIKUBE_NONE_USER=true\".",
	"This control plane is not running! (state={{.state}})": "",
	"This driver does not yet work on your architecture. Maybe try --driver=none": "",
	"This is unusual - you may want to investigate using \"{{.command}}\"": "",
	"This will keep the existing kubectl context and will create a minikube context.": "Cela permet de conserver le contexte kubectl existent et de créer un contexte minikube.",
	"This will start the mount daemon and automatically mount files into minikube": "Cela permet de lancer le daemon d'installation et d'installer automatiquement les fichiers dans minikube.",
	"This will start the mount daemon and automatically mount files into minikube.": "",
	"This {{.type}} is having trouble accessing https://{{.repository}}": "",
	"Tip: To remove this root owned cluster, run: sudo {{.cmd}}": "",
	"Tip: To remove this root owned cluster, run: sudo {{.cmd}} delete": "Conseil : Pour supprimer ce cluster appartenant à la racine, exécutez la commande \"sudo {{.cmd}} delete\".",
	"To connect to this cluster, use:  --context={{.name}}": "",
	"To connect to this cluster, use: kubectl --context={{.name}}": "Pour vous connecter à ce cluster, utilisez la commande \"kubectl --context={{.name}}\".",
	"To connect to this cluster, use: kubectl --context={{.name}}__1": "Pour vous connecter à ce cluster, utilisez la commande \"kubectl --context={{.name}}\".",
	"To connect to this cluster, use: kubectl --context={{.profile_name}}": "",
	"To disable this notice, run: 'minikube config set WantUpdateNotification false'\\n": "",
	"To pull new external images, you may need to configure a proxy: https://minikube.sigs.k8s.io/docs/reference/networking/proxy/": "",
	"To see addons list for other profiles use: `minikube addons -p name list`": "",
	"To set your Google Cloud project,  run: \n\n\t\tgcloud config set project \u003cproject name\u003e\n\nor set the GOOGLE_CLOUD_PROJECT environment variable.": "",
	"To start a cluster, run: \"{{.command}}\"": "",
	"To start minikube with Hyper-V, Powershell must be in your PATH`": "",
	"To track progress on multi-node clusters, see https://github.com/kubernetes/minikube/issues/7538.": "",
	"To use kubectl or minikube commands as your own user, you may need to relocate them. For example, to overwrite your own settings, run:": "Pour utiliser les commandes kubectl ou minikube sous votre propre nom d'utilisateur, vous devrez peut-être les déplacer. Par exemple, pour écraser vos propres paramètres, exécutez la commande suivante :",
	"Troubleshooting Commands:": "",
	"Try 'minikube delete' to force new SSL certificates to be installed": "",
	"Try 'minikube delete', and disable any conflicting VPN or firewall software": "",
	"Trying to delete invalid profile {{.profile}}": "",
	"Unable to bind flags": "",
	"Unable to create dedicated network, this might result in cluster IP change after restart: {{.error}}": "",
	"Unable to enable dashboard": "",
	"Unable to fetch latest version info": "",
	"Unable to find control plane": "",
	"Unable to generate docs": "",
	"Unable to generate the documentation. Please ensure that the path specified is a directory, exists \u0026 you have permission to write to it.": "",
	"Unable to get bootstrapper: {{.error}}": "Impossible d'obtenir l'amorceur : {{.error}}",
	"Unable to get command runner": "",
	"Unable to get control plane status: {{.error}}": "",
	"Unable to get current user": "",
	"Unable to get forwarded endpoint": "",
	"Unable to get machine status": "",
	"Unable to get runtime": "",
	"Unable to kill mount process: {{.error}}": "",
	"Unable to load cached images from config file.": "Impossible de charger les images mises en cache depuis le fichier de configuration.",
	"Unable to load cached images: {{.error}}": "",
	"Unable to load config: {{.error}}": "Impossible de charger la configuration : {{.error}}",
	"Unable to load host": "",
	"Unable to parse \"{{.kubernetes_version}}\": {{.error}}": "Impossible d'analyser la version \"{{.kubernetes_version}}\" : {{.error}}",
	"Unable to parse default Kubernetes version from constants: {{.error}}": "",
	"Unable to parse memory '{{.memory}}': {{.error}}": "",
	"Unable to parse oldest Kubernetes version from constants: {{.error}}": "",
	"Unable to pick a default driver. Here is what was considered, in preference order:": "",
	"Unable to pull images, which may be OK: {{.error}}": "Impossible d'extraire des images, qui sont peut-être au bon format : {{.error}}",
	"Unable to push cached images: {{.error}}": "",
	"Unable to remove machine directory": "",
	"Unable to restart cluster, will reset it: {{.error}}": "",
	"Unable to safely downgrade existing Kubernetes v{{.old}} cluster to v{{.new}}": "",
	"Unable to stop VM": "",
	"Unable to update {{.driver}} driver: {{.error}}": "",
	"Unfortunately, could not download the base image {{.image_name}} ": "",
	"Uninstalling Kubernetes {{.kubernetes_version}} using {{.bootstrapper_name}} ...": "Désinstallation de Kubernetes {{.kubernetes_version}} à l'aide de {{.bootstrapper_name}}…",
	"Unmounting {{.path}} ...": "",
	"Unpaused {{.count}} containers": "",
	"Unpaused {{.count}} containers in: {{.namespaces}}": "",
	"Unpausing node {{.name}} ... ": "",
	"Unset the KUBECONFIG environment variable, or verify that it does not point to an empty or otherwise invalid path": "",
	"Unset variables instead of setting them": "",
	"Update kubeconfig in case of an IP or port change": "",
	"Update server returned an empty list": "",
	"Updating the running {{.driver_name}} \"{{.cluster}}\" {{.machine_type}} ...": "Mise à jour du {{.machine_type}} {{.driver_name}} en marche \"{{.cluster}}\" ...",
	"Upgrade to QEMU v3.1.0+, run 'virt-host-validate', or ensure that you are not running in a nested VM environment.": "",
	"Upgrading from Kubernetes {{.old}} to {{.new}}": "Mise à niveau de Kubernetes de la version {{.old}} à la version {{.new}}…",
	"Usage": "Usage",
	"Usage: minikube completion SHELL": "",
	"Usage: minikube delete": "",
	"Usage: minikube delete --all --purge": "",
	"Usage: minikube node [add|start|stop|delete|list]": "",
	"Usage: minikube node delete [name]": "",
	"Usage: minikube node list": "",
	"Usage: minikube node start [name]": "",
	"Usage: minikube node stop [name]": "",
	"Use \"{{.CommandPath}} [command] --help\" for more information about a command.": "",
	"Use 'kubect get po -A' to find the correct and namespace name": "",
	"Use -A to specify all namespaces": "",
	"Use VirtualBox to remove the conflicting VM and/or network interfaces": "",
	"Use native Golang SSH client (default true). Set to 'false' to use the command line 'ssh' command when accessing the docker machine. Useful for the machine drivers when they will not start with 'Waiting for SSH'.": "",
	"User ID:      {{.userID}}": "",
	"Userspace file server is shutdown": "",
	"Userspace file server: ": "",
	"Using image repository {{.name}}": "Utilisation du dépôt d'images {{.name}}…",
	"Using podman 2 is not supported yet. your version is \"{{.currentVersion}}\". minikube might not work. use at your own risk.": "",
	"Using the '{{.runtime}}' runtime with the 'none' driver is an untested configuration!": "",
	"Using the {{.driver}} driver based on existing profile": "Utilisation du pilote {{.driver}} basé sur le profil existant",
	"Using the {{.driver}} driver based on user configuration": "Utilisation du pilote {{.driver}} basé sur la configuration de l'utilisateur",
	"VM driver is one of: %v": "Le pilote de la VM appartient à : %v",
	"Valid components are: {{.valid_extra_opts}}": "",
	"Validation unable to parse disk size '{{.diskSize}}': {{.error}}": "",
	"Verify that your HTTP_PROXY and HTTPS_PROXY environment variables are set correctly.": "",
	"Verifying Kubernetes components...": "",
	"Verifying dashboard health ...": "",
	"Verifying proxy health ...": "",
	"Verifying {{.addon_name}} addon...": "",
	"Verifying:": "Vérification :",
	"Version:      {{.version}}": "",
	"VirtualBox and Hyper-V are having a conflict. Use '--driver=hyperv' or disable Hyper-V using: 'bcdedit /set hypervisorlaunchtype off'": "",
	"VirtualBox cannot create a network, probably because it conflicts with an existing network that minikube no longer knows about. Try running 'minikube delete'": "",
	"VirtualBox is broken. Disable real-time anti-virus software, reboot, and reinstall VirtualBox if the problem continues.": "",
	"VirtualBox is broken. Reinstall VirtualBox, reboot, and run 'minikube delete'.": "",
	"VirtualBox is unable to find its network interface. Try upgrading to the latest release and rebooting.": "",
	"Virtualization support is disabled on your computer. If you are running minikube within a VM, try '--driver=docker'. Otherwise, consult your systems BIOS manual for how to enable virtualization.": "",
	"Wait failed: {{.error}}": "",
	"Wait until Kubernetes core services are healthy before exiting": "Avant de quitter, veuillez patienter jusqu'à ce que les principaux services Kubernetes soient opérationnels.",
	"Waiting for SSH access ...": "En attente de l'accès SSH...",
	"Waiting for:": "En attente de :",
	"Want kubectl {{.version}}? Try 'minikube kubectl -- get pods -A'": "",
	"Where to root the NFS Shares, defaults to /nfsshares (hyperkit driver only)": "Emplacement permettant d'accéder aux partages NFS en mode root, la valeur par défaut affichant /nfsshares (pilote hyperkit uniquement).",
	"Whether to use external switch over Default Switch if virtual switch not explicitly specified. (hyperv driver only)": "",
	"With --network-plugin=cni, you will need to provide your own CNI. See --cni flag as a user-friendly alternative": "",
	"You appear to be using a proxy, but your NO_PROXY environment does not include the minikube IP ({{.ip_address}}).": "",
	"You appear to be using a proxy, but your NO_PROXY environment does not include the minikube IP ({{.ip_address}}). Please see {{.documentation_url}} for more details": "Il semble que vous utilisiez un proxy, mais votre environment NO_PROXY n'inclut pas l'adresse IP ({{.ip_address}}) de minikube. Consultez la documentation à l'adresse {{.documentation_url}} pour en savoir plus.",
	"You can delete them using the following command(s): ": "",
	"You can force an unsupported Kubernetes version via the --force flag": "",
	"You cannot change the CPUs for an existing minikube cluster. Please first delete the cluster.": "",
	"You cannot change the Disk size for an exiting minikube cluster. Please first delete the cluster.": "",
	"You cannot change the memory size for an exiting minikube cluster. Please first delete the cluster.": "",
	"You may need to manually remove the \"{{.name}}\" VM from your hypervisor": "Vous devrez peut-être supprimer la VM \"{{.name}}\" manuellement de votre hyperviseur.",
	"You may need to stop the Hyper-V Manager and run `minikube delete` again.": "",
	"You must specify a service name": "",
	"Your GCP credentials will now be mounted into every pod created in the {{.name}} cluster.": "",
	"Your host does not support KVM virtualization. Ensure that qemu-kvm is installed, and run 'virt-host-validate' to debug the problem": "",
	"Your host does not support virtualization. If you are running minikube within a VM, try '--driver=docker'. Otherwise, enable virtualization in your BIOS": "",
	"Your host is failing to route packets to the minikube VM. If you have VPN software, try turning it off or configuring it so that it does not re-route traffic to the VM IP. If not, check your VM environment routing options.": "",
	"Your minikube config refers to an unsupported driver. Erase ~/.minikube, and try again.": "",
	"Your minikube vm is not running, try minikube start.": "",
	"[WARNING] For full functionality, the 'csi-hostpath-driver' addon requires the 'volumesnapshots' addon to be enabled.\n\nYou can enable 'volumesnapshots' addon by running: 'minikube addons enable volumesnapshots'\n": "",
	"addon '{{.name}}' is currently not enabled.\nTo enable this addon run:\nminikube addons enable {{.name}}": "",
	"addon '{{.name}}' is not a valid addon packaged with minikube.\nTo see the list of available addons run:\nminikube addons list": "",
	"addons modifies minikube addons files using subcommands like \"minikube addons enable dashboard\"": "",
	"bash completion failed": "",
	"call with cleanup=true to remove old tunnels": "",
	"config modifies minikube config files using subcommands like \"minikube config set driver kvm\"\nConfigurable fields: \\n\\n": "",
	"config view failed": "",
	"dashboard service is not running: {{.error}}": "",
	"delete ctx": "",
	"deleting node": "",
	"disable failed": "",
	"dry-run mode. Validates configuration, but does not mutate system state": "",
	"dry-run validation complete!": "",
	"enable failed": "",
	"enable metrics-server addon instead of heapster addon because heapster is deprecated": "",
	"error creating clientset": "",
	"error getting primary control plane": "",
	"error getting ssh port": "",
	"error parsing the input ip address for mount": "",
	"error provisioning host": "",
	"error starting tunnel": "",
	"error stopping tunnel": "",
	"error: --output must be 'yaml' or 'json'": "",
	"experimental": "",
	"failed to add node": "",
	"failed to open browser: {{.error}}": "",
	"failed to save config": "",
	"failed to start node": "",
	"fish completion failed": "",
	"if true, will embed the certs in kubeconfig.": "",
	"if you want to create a profile you can by this command: minikube start -p {{.profile_name}}": "",
	"initialization failed, will try again: {{.error}}": "",
	"keep the kube-context active after cluster is stopped. Defaults to false.": "",
	"kubeadm detected a TCP port conflict with another process: probably another local Kubernetes installation. Run lsof -p\u003cport\u003e to find the process and kill it": "",
	"kubectl and minikube configuration will be stored in {{.home_folder}}": "Les configurations kubectl et minikube seront stockées dans le dossier {{.home_folder}}.",
	"kubectl not found. If you need it, try: 'minikube kubectl -- get pods -A'": "",
	"kubectl proxy": "",
	"libmachine failed": "",
	"list displays all valid default settings for PROPERTY_NAME\nAcceptable fields: \\n\\n": "",
	"max time to wait per Kubernetes or host to be healthy.": "",
	"minikube addons list --output OUTPUT. json, list": "",
	"minikube is exiting due to an error. If the above message is not useful, open an issue:": "",
	"minikube is missing files relating to your guest environment. This can be fixed by running 'minikube delete'": "",
	"minikube is unable to access the Google Container Registry. You may need to configure it to use a HTTP proxy.": "",
	"minikube is unable to connect to the VM: {{.error}}\n\n\tThis is likely due to one of two reasons:\n\n\t- VPN or firewall interference\n\t- {{.hypervisor}} network configuration issue\n\n\tSuggested workarounds:\n\n\t- Disable your local VPN or firewall software\n\t- Configure your local VPN or firewall to allow access to {{.ip}}\n\t- Restart or reinstall {{.hypervisor}}\n\t- Use an alternative --vm-driver\n\t- Use --force to override this connectivity check\n\t": "",
	"minikube profile was successfully set to {{.profile_name}}": "Le profil de minikube a été défini avec succès sur {{.profile_name}}",
	"minikube provisions and manages local Kubernetes clusters optimized for development workflows.": "minikube provisionne et gère des clusters Kubernetes locaux optimisés pour les workflows de développement.",
	"minikube quickly sets up a local Kubernetes cluster": "minikube configure rapidement un cluster Kubernetes local",
	"minikube skips various validations when --force is supplied; this may lead to unexpected behavior": "minikube ignore diverses validations lorsque --force est fourni ; cela peut conduire à un comportement inattendu",
	"minikube status --output OUTPUT. json, text": "",
	"minikube {{.version}} is available! Download it: {{.url}}": "minikube {{.version}} est disponible ! Téléchargez-le ici : {{.url}}",
	"mkcmp is used to compare performance of two minikube binaries": "mkcmp est utilisé pour comparer les performances de deux binaires minikube",
	"mount argument \"{{.value}}\" must be in form: \u003csource directory\u003e:\u003ctarget directory\u003e": "argument de montage \"{{.value}}\" doit être de la forme : \u003cdossier source\u003e:\u003cdossier de destination\u003e",
	"mount failed": "échec du montage",
	"namespaces to pause": "espaces de noms à mettre en pause",
	"namespaces to unpause": "espaces de noms à réactiver",
	"none driver does not support multi-node clusters": "aucun pilote ne prend pas en charge les clusters multi-nœuds",
	"not enough arguments ({{.ArgCount}}).\\nusage: minikube config set PROPERTY_NAME PROPERTY_VALUE": "pas assez d'arguments ({{.ArgCount}}).\\nusage : minikube config set PROPERTY_NAME PROPERTY_VALUE",
	"output layout (EXPERIMENTAL, JSON only): 'nodes' or 'cluster'": "format de sortie (EXPERIMENTAL, JSON uniquement) : 'nodes' ou 'cluster'",
	"pause Kubernetes": "met Kubernetes en pause",
	"preload extraction failed: \\\"No space left on device\\\"": "",
	"profile sets the current minikube profile, or gets the current profile if no arguments are provided.  This is used to run and manage multiple minikube instance.  You can return to the default minikube profile by running `minikube profile default`": "profile définit le profil courrant de minikube, ou obtient le profil actuel si aucun argument n'est fourni. Ceci est utilisé pour exécuter et gérer plusieurs instances de minikube. Vous pouvez revenir au profil par défaut du minikube en exécutant `minikube profile default`",
	"provisioning host for node": "provisionne un hôte pour le nœud",
	"reload cached images.": "recharge les cache des images.",
	"reloads images previously added using the 'cache add' subcommand": "recharge les images précédemment ajoutées à l'aide de la sous-commande 'cache add'",
	"retrieving node": "récupération du nœud",
	"service {{.namespace_name}}/{{.service_name}} has no node port": "le service {{.namespace_name}}/{{.service_name}} n'a pas de port de nœud",
	"stat failed": "stat en échec",
	"status json failure": "état du JSON en échec",
	"status text failure": "état du texte en échec",
	"toom any arguments ({{.ArgCount}}).\\nusage: minikube config set PROPERTY_NAME PROPERTY_VALUE": "toom tous les arguments ({{.ArgCount}}).\\nusage : jeu de configuration de minikube PROPERTY_NAME PROPERTY_VALUE",
	"tunnel creates a route to services deployed with type LoadBalancer and sets their Ingress to their ClusterIP. for a detailed example see https://minikube.sigs.k8s.io/docs/tasks/loadbalancer": "le tunnel crée une route vers les services déployés avec le type LoadBalancer et définit leur Ingress sur leur ClusterIP. Pour un exemple détaillé, voir https://minikube.sigs.k8s.io/docs/tasks/loadbalancer",
	"unable to bind flags": "impossible de lier les configurations",
	"unable to delete minikube config folder": "impossible de supprimer le dossier de configuration de minikube",
	"unable to set logtostderr": "impossible de définir logtostderr",
	"unpause Kubernetes": "réactive Kubernetes",
	"unset failed": "échec de la déconfiguration",
	"unsets PROPERTY_NAME from the minikube config file.  Can be overwritten by flags or environmental variables": "déconfigure PROPERTY_NAME du fichier de configuration de minikube. Peut-être écrasé par des arguments ou variables d'environnement",
	"unsets an individual value in a minikube config file": "déconfigure une valeur individuelle dans le fichier de configuration de minikube",
	"unsupported or missing driver: {{.name}}": "pilote non pris en charge ou manquant : {{.name}}",
	"update config": "mettre à jour la configuration",
	"usage: minikube addons configure ADDON_NAME": "usage : minikube addons configure ADDON_NAME",
	"usage: minikube addons disable ADDON_NAME": "usage : minikube addons disable ADDON_NAME",
	"usage: minikube addons enable ADDON_NAME": "usage : minikube addons enable ADDON_NAME",
	"usage: minikube addons list": "usage : minikube addons list",
	"usage: minikube addons open ADDON_NAME": "usage : minikube addons open ADDON_NAME",
	"usage: minikube config unset PROPERTY_NAME": "usage : minikube config unset PROPERTY_NAME",
	"usage: minikube delete": "usage : minikube delete",
	"usage: minikube profile [MINIKUBE_PROFILE_NAME]": "usage : minikube profile [MINIKUBE_PROFILE_NAME]",
	"version json failure": "échec de la version du JSON",
	"version yaml failure": "échec de la version du YAML",
	"zsh completion failed": "complétion de zsh en échec",
	"{{ .name }}: {{ .rejection }}": "{{ .name }} : {{ .rejection }}",
	"{{.Driver}} is currently using the {{.StorageDriver}} storage driver, consider switching to overlay2 for better performance": "",
	"{{.count}} nodes stopped.": "{{.count}} nœud(s) arrêté(s).",
	"{{.driver_name}} \"{{.cluster}}\" {{.machine_type}} is missing, will recreate.": "{{.driver_name}} \"{{.cluster}}\" {{.machine_type}} est manquant, il va être recréé.",
	"{{.driver_name}} couldn't proceed because {{.driver_name}} service is not healthy.": "{{.driver_name}} n'a pas pu continuer car le service {{.driver_name}} n'est pas fonctionnel.",
	"{{.driver_name}} has less than 2 CPUs available, but Kubernetes requires at least 2 to be available": "{{.driver_name}} dispose de moins de 2 processeurs disponibles, mais Kubernetes nécessite au moins 2 procésseurs pour fonctionner",
	"{{.driver_name}} has only {{.container_limit}}MB memory but you specified {{.specified_memory}}MB": "{{.driver_name}} ne dispose que de {{.container_limit}}Mo de mémoire, mais vous avez spécifié {{.specified_memory}}Mo",
	"{{.driver}} only has {{.size}}MiB available, less than the required {{.req}}MiB for Kubernetes": "{{.driver}} ne dispose que de {{.size}}Mio disponible, moins que les {{.req}}Mio requis pour Kubernetes",
	"{{.extra_option_component_name}}.{{.key}}={{.value}}": "",
	"{{.name}} has no available configuration options": "{{.name}} n'a pas d'options de configuration disponible",
	"{{.name}} is already running": "{{.name}} est déjà en cours d'exécution",
	"{{.name}} was successfully configured": "{{.name}} a été configuré avec succès",
	"{{.n}} is nearly out of disk space, which may cause deployments to fail! ({{.p}}% of capacity)": "",
	"{{.n}} is out of disk space! (/var is at {{.p}}% of capacity)": "",
	"{{.ocibin}} is taking an unsually long time to respond, consider restarting {{.ocibin}}": "{{.oxibin}} prend un temps anormalement long pour répondre, pensez à redémarrer {{.osibin}}",
	"{{.path}} is version {{.client_version}}, which may have incompatibilites with Kubernetes {{.cluster_version}}.": "{{.path}} est la version {{.client_version}}, qui peut comporter des incompatibilités avec Kubernetes {{.cluster_version}}.",
	"{{.prefix}}minikube {{.version}} on {{.platform}}": "{{.prefix}}minikube {{.version}} sur {{.platform}}",
	"{{.type}} is not yet a supported filesystem. We will try anyways!": "{{.type}} n'est pas encore un système de fichiers pris en charge. Nous essaierons quand même !",
	"{{.url}} is not accessible: {{.error}}": "{{.url}} n'est pas accessible : {{.error}}"
}